[
  {
    "grade": 4,
    "passage_code": "G4-001",
    "title": "Raindrop's Dream to Be a Snowflake",
    "text": "Once upon a time, a little raindrop named Raina lived in a gray cloud. She loved falling gently to the earth, but she always dreamed of becoming a snowflake. Raina had heard stories from the wind about how snowflakes danced and sparkled in the cold winter air. One chilly day, Raina wished with all her heart to become a snowflake. The cloud listened and sent her down on a cold breeze. As she fell, the air grew colder, and Raina felt herself changing. Her round shape turned into a delicate, six-pointed star. She was a sparkling snowflake! Raina twirled happily, swirling in the winter sky. She realized that dreams can come true when you believe. From that day on, Raina loved being a snowflake, shining bright and making the world magical in winter."
  },
  {
    "grade": 4,
    "passage_code": "G4-002",
    "title": "Cool-Down Breathing After Sports",
    "text": "After playing sports or doing exercise, it's important to cool down your body. One way to do this is with cool-down breathing. Cool-down breathing helps your heart slow down and your muscles relax. When you finish running, jumping, or playing, take a deep breath in through your nose. Hold it for a few seconds, then slowly breathe out through your mouth. Try to make your out-breath last longer than your in-breath. You can repeat this five to ten times. This simple exercise helps your body return to a resting state and can make you feel calm. Athletes often use cool-down breathing to stay healthy and avoid feeling tired or dizzy after sports. Next time you play sports, remember to take time for cool-down breathing to help your body feel good!"
  },
  {
    "grade": 4,
    "passage_code": "G4-003",
    "title": "Why Bubbles Are Round",
    "text": "Bubbles are fun to blow and watch. Have you ever wondered why bubbles are always round? The reason has to do with science! A bubble is made of a thin layer of soap and water. When you blow air into the soap film, it forms a shape that holds the air inside. This shape is called a sphere, which looks like a ball. The sphere is special because it has the smallest surface area for the amount of air inside. This means the bubble uses the least amount of soap film to hold the air, making it strong and stable. If bubbles were not round, they would have bigger surfaces and could pop easily. So, bubbles are round because nature likes to save energy and make things work well. Next time you blow bubbles, remember this cool science fact!"
  },
  {
    "grade": 4,
    "passage_code": "G4-004",
    "title": "Raking Leaves Together",
    "text": "\"Look at all these leaves on the ground!\" said Mia as she stepped outside. \"Yes, fall is here,\" replied her brother, Jake. \"We should rake them into a big pile.\" \"Okay! I'll grab the rake,\" Mia said. Jake smiled. \"I love jumping in the piles after we finish raking.\" Mia laughed. \"Me too! But first, we have to finish the work.\" They both started to rake, moving the leaves into one big pile. \"This is hard work,\" Jake said, \"but it's fun because we're doing it together.\" \"And it makes the yard look so nice!\" added Mia. After a while, the pile was big enough. Mia jumped in and laughed. Jake joined her, and they both had a great time playing. \"Raking leaves is a lot of work, but it's worth it,\" Jake said happily. \"I agree!\" Mia nodded. \"I'm glad we did this together.\""
  },
  {
    "grade": 4,
    "passage_code": "G4-005",
    "title": "The Mystery of the Missing Sticker",
    "text": "Step 1: Emma loved collecting stickers. One day, her favorite shiny star sticker was missing from her sticker book. Step 2: She asked her little brother, Max, if he saw it. Max said he didn't, but he wanted to help find the sticker. Step 3: Emma checked her backpack carefully. No sticker there. Step 4: She looked under her bed and behind her desk. Still no sticker. Step 5: Max suggested they check the living room. There, near the couch, they saw a small shiny star sticker on the floor! Step 6: Emma picked it up and smiled. The mystery was solved! The sticker had fallen out of her book during playtime. Step 7: She put the sticker back carefully and thanked Max for helping. Now, Emma knew that sometimes, asking for help can solve any mystery."
  },
  {
    "grade": 4,
    "passage_code": "G4-006",
    "title": "Felix the Fox and His Button Collection",
    "text": "Step 1: Felix the Fox loved to explore the forest near his home. One day, he found a shiny blue button on the ground. He picked it up carefully and put it in his small pouch. Step 2: Felix decided to collect buttons because they were colorful and special. Every day, he searched for buttons under leaves, inside tree holes, and near the riverbank. Step 3: Felix's collection grew bigger. He had red, green, yellow, and even a sparkly silver button! He kept them all neatly in a wooden box. Step 4: One rainy afternoon, Felix met a little bunny who lost her button from her coat. Felix gave her a green button from his collection. The bunny smiled and thanked him. Step 5: Felix felt happy because he shared his buttons with friends. He learned that collecting was fun, but sharing made it even better."
  },
  {
    "grade": 4,
    "passage_code": "G4-007",
    "title": "Learning to Set the Ball in Volleyball",
    "text": "Last Saturday, Mia joined her first volleyball practice. She was excited but also a little nervous because she had never played volleyball before. Coach Tom explained the different ways to hit the ball. One special skill Mia wanted to learn was called 'setting.' Setting means using your fingertips to push the ball high into the air so a teammate can spike it over the net. During practice, Mia tried to set the ball several times. At first, the ball fell to the ground, but she kept trying. Coach Tom showed her how to keep her hands above her head and bend her knees. After a while, Mia made a perfect set that her friend caught easily. She felt proud and happy. Mia knew that with practice, she would become an even better volleyball player."
  },
  {
    "grade": 4,
    "passage_code": "G4-008",
    "title": "Calming Down: Quick Breaths vs. Slow Breaths",
    "text": "When you feel upset or angry, your body might feel fast and tense. Quick breaths happen naturally, but they can make you feel even more restless. On the other hand, slow breaths help your body calm down. Quick breaths are short and shallow, while slow breaths are deep and steady. Quick breathing can make your heart beat faster, but slow breathing helps your heart slow down. Both types of breathing are natural, but slow breathing is better when you want to relax. By taking slow, deep breaths, you give your brain a chance to feel peaceful. Next time you feel upset, try counting to four as you breathe in, then count to four as you breathe out. This simple trick can help you feel calm and ready to smile again!"
  },
  {
    "grade": 4,
    "passage_code": "G4-009",
    "title": "The Cookie That Didn't Want to Be Eaten",
    "text": "In the kitchen, there were two cookies. Both looked delicious, but they were very different. The first cookie was happy to be eaten. It dreamed of being enjoyed with a glass of milk. It smiled and waved at the children when they opened the jar. The second cookie, however, was very funny. It did not want to be eaten at all! When the children reached for it, the cookie would wiggle and hide behind the others. Unlike the first cookie, it loved its spot on the plate and wanted to stay fresh forever. The two cookies had opposite wishes: one wanted to be eaten quickly, and the other wanted to stay safe and tasty. Even though they were both cookies, their funny feelings made them very different friends in the jar!"
  },
  {
    "grade": 4,
    "passage_code": "G4-010",
    "title": "The Big Race: A Lesson in Humility",
    "text": "Sarah and Tom had been preparing for the school's annual race for weeks. On race day, the whole school gathered to watch. As the race began, Sarah ran fast and soon took the lead. Tom cheered from the sidelines, hoping for his friend's success. After crossing the finish line first, Sarah smiled and walked over to Tom. \"Did you see that? I won!\" Tom grinned, \"Yes! You were amazing out there.\" Sarah then said, \"Thanks, Tom. But I couldn't have done it without all the practice and support from you and our friends.\" Tom nodded. \"That's true. Winning feels great, but being kind and humble is even better.\" Sarah agreed, \"Next time, let's train together and try our best, no matter who wins.\" They both laughed and promised to always support each other, whether they won or lost."
  },
  {
    "grade": 4,
    "passage_code": "G4-011",
    "title": "The Garden Gnome's Secret Notes",
    "text": "One sunny morning, Mia walked into her backyard and noticed something strange. The garden gnome by the flower bed wasn't in its usual spot. \"Hello?\" Mia called out. Suddenly, a tiny note appeared at her feet. She picked it up and read aloud, \"Good morning, Mia! It's me, your garden gnome. I like to write notes to make our garden fun.\" Mia laughed and said, \"A talking gnome? That's amazing! What do you want to tell me today?\" The next note appeared: \"Look closely! The sunflowers are smiling because you water them every day. Keep up the good work!\" Mia smiled and replied, \"Thank you, little gnome. I'll take even better care of the garden.\" From that day on, Mia found new notes from her garden gnome, each one making her garden adventures even more exciting."
  },
  {
    "grade": 4,
    "passage_code": "G4-012",
    "title": "The Fun of Flying Kites",
    "text": "When the wind blows gently on a sunny day, kids love to fly kites. The wind helps the kite rise high into the sky. If there is no wind, the kite will not fly and will just fall to the ground. When the wind is strong, the kite can fly very high, but it can also be hard to control. This is why children choose days with steady, gentle wind to enjoy kite flying. Flying kites is fun because it makes children happy and active. They run across the field holding the string, watching their colorful kites soar. Sometimes, they even race their kites to see which one can fly the highest. Because flying kites needs wind, kids wait for the perfect weather. When the wind stops, the kite falls, and the fun ends. That is why the wind causes the kite to fly and makes kite flying an exciting game to play outside."
  },
  {
    "grade": 4,
    "passage_code": "G4-013",
    "title": "A Day at the Pond",
    "text": "Lily and her brother Max stood by the pond, watching the water ripple. \"Look, Max! A frog!\" Lily exclaimed. Max pointed to a turtle sunbathing on a rock. \"Ponds are full of life,\" he said. Their teacher, Mr. Green, joined them. \"Did you know that a pond is a habitat?\" he asked. \"It is home to many animals and plants.\" Lily asked, \"What kind of animals live here?\" Mr. Green smiled, \"Frogs, turtles, insects, and fish all live in ponds. The plants around the pond provide food and shelter for these creatures.\" Max added, \"I see dragonflies flying above the water. Are they part of the pond habitat too?\" \"Yes,\" Mr. Green said, \"Every plant and animal plays a role in keeping the pond healthy.\" Lily nodded, excited to learn more about their new outdoor classroom."
  },
  {
    "grade": 4,
    "passage_code": "G4-014",
    "title": "Fun with Word Search Games",
    "text": "Word search games are a fun way to play and learn new words at the same time. In a word search, you look for words hidden in a grid of letters. These words can be placed horizontally, vertically, or diagonally. Playing word search games helps improve your concentration and spelling skills. You can play alone or with friends, making it a great activity for both quiet time and group fun. Some word searches have themes, like animals or sports, which makes the game even more interesting. When you find a word, you can circle it or highlight it. Completing a word search gives you a sense of achievement and can boost your confidence. Next time you want to play, try a word search and see how many words you can find!"
  },
  {
    "grade": 4,
    "passage_code": "G4-015",
    "title": "Trying a New Food",
    "text": "One sunny afternoon, Mia visited her friend Carlos's house. Carlos's family was from a different country, and they often ate foods Mia had never seen before. Today, Carlos's mom brought out a dish called sushi. Mia was curious but a little nervous. She had never tried raw fish before! Carlos smiled and said, \"It's really tasty, and I think you'll like it.\" Mia took a small piece and held it in her hand. She took a deep breath and decided to be brave. When she tasted the sushi, it was different but not bad at all! The flavors were fresh and a little sweet. Mia felt proud for trying something new. After that day, she was excited to learn more about different foods and cultures. Trying new things can be fun and delicious!"
  },
  {
    "grade": 4,
    "passage_code": "G4-016",
    "title": "The Brave Little Spoon",
    "text": "Once upon a time, in a cozy kitchen drawer, lived a brave little spoon named Spark. Step 1: Every morning, Spark waited eagerly for breakfast time. When the big cereal bowl came out, Spark was ready to help. Step 2: Spark scooped up crunchy flakes and cold milk carefully. Sometimes, the flakes would slip, but Spark never gave up. Step 3: One day, a little boy dropped his spoon in the muddy garden. Spark knew it was his chance to be a hero. He rolled off the table and landed near the boy. Step 4: The boy picked up Spark, cleaned him, and smiled wide. Spark felt proud and brave because he helped his friend. From that day on, Spark was not just any spoon-he was the brave little spoon who never quit!"
  },
  {
    "grade": 4,
    "passage_code": "G4-017",
    "title": "Understanding Pulleys: Fixed vs. Movable",
    "text": "A pulley is a simple machine that helps us lift heavy objects more easily. There are two main types of pulleys: fixed pulleys and movable pulleys. A fixed pulley is attached to a solid structure, like a ceiling or a beam. It changes the direction of the force you apply. For example, when you pull down on a rope, the pulley helps lift the object up. However, a fixed pulley does not reduce the amount of effort needed to lift the object. On the other hand, a movable pulley moves along with the load. This type of pulley helps reduce the effort needed to lift something heavy. You have to pull the rope a longer distance, but it requires less force. In summary, fixed pulleys change the direction of force without reducing effort, while movable pulleys reduce effort but need more rope to be pulled. Both types are useful for making work easier in different ways."
  },
  {
    "grade": 4,
    "passage_code": "G4-018",
    "title": "How Cone Weaving Drills Help Improve Sports Skills",
    "text": "Cone weaving drills are a popular exercise in many sports like soccer and football. These drills involve running quickly around a series of cones set in a row or zigzag pattern. The main goal of cone weaving is to improve a player's agility and speed. When players practice weaving through cones, they learn to change direction quickly without losing balance. This skill is important because in sports, players often need to dodge opponents or move fast in tight spaces. As a result, athletes who do cone weaving drills regularly can react faster during games. They can also keep better control of the ball while moving. Therefore, coaches include cone weaving in training sessions to help players become better and more confident. The drills cause players to develop stronger muscles and sharper reflexes, which are useful for many sports challenges."
  },
  {
    "grade": 4,
    "passage_code": "G4-019",
    "title": "Mammals and Their Babies: How They Are Alike and Different",
    "text": "Mammals are a special group of animals. One thing that all mammals have in common is that they give birth to live babies. Unlike birds that lay eggs, mammal mothers carry their babies inside their bodies until they are ready to be born. After birth, mammal babies drink milk from their mothers. This milk gives them the nutrients they need to grow strong. However, mammals can be very different from each other too. For example, some mammals, like humans and dogs, take care of their babies for a long time, teaching them how to live. Other mammals, like deer, leave their babies alone after a short time to protect themselves from danger. Some mammals are very small, like mice, and others are huge, like elephants. Even though they are different in many ways, all mammal babies need their mother's care to survive and grow healthy."
  },
  {
    "grade": 4,
    "passage_code": "G4-020",
    "title": "How to Recycle and Sort Waste",
    "text": "Recycling is important because it helps protect our planet. When we recycle, we turn old items into new ones instead of throwing them away. To recycle properly, you need to sort your waste into different groups. Follow these steps to sort and recycle your waste correctly. Step 1: Separate paper and cardboard from other trash. Paper can be recycled to make new books and boxes. Step 2: Put plastic bottles and containers in a different bin. Make sure they are empty and clean before recycling. Step 3: Collect glass bottles and jars separately. Glass can be melted and made into new glass items. Step 4: Metal cans like soda cans should go into their own bin. They can be recycled many times. Step 5: Finally, food scraps and yard waste should be composted, not recycled. This helps make healthy soil. By sorting your waste carefully, you help reduce pollution and save natural resources."
  },
  {
    "grade": 4,
    "passage_code": "G4-021",
    "title": "Learning to Skate for Hockey",
    "text": "Jamie was very excited. Today was the first day of hockey practice. She had her new skates ready and a helmet to keep her safe. At the rink, Coach Mike showed the team how to stand on their skates and keep their balance. \"Bend your knees a little and lean forward,\" he said. Jamie tried it and felt wobbly, but she did not give up. Next, the coach taught them how to glide on the ice by pushing off with one foot at a time. Jamie practiced moving slowly across the rink. She fell a few times but laughed and got up quickly. By the end of practice, Jamie could skate a little better and was proud of herself. She knew that with more practice, she would be ready to play hockey like a pro."
  },
  {
    "grade": 4,
    "passage_code": "G4-022",
    "title": "The Game of Taking Turns",
    "text": "One sunny afternoon, Emma and her friends decided to play a board game. There were four players, and everyone was excited. Before starting, Emma reminded her friends about taking turns. \"It's fair and makes the game fun for everyone!\" she said. As the game began, each player waited patiently for their turn. When it was Sam's turn, he rolled the dice and moved his piece. Then it was Mia's turn, and she smiled as she carefully planned her move. Even when it wasn't their turn, the friends cheered for each other. If someone forgot and tried to take two turns in a row, the others gently reminded them. By taking turns, they all enjoyed the game more and learned to be patient and fair. At the end, everyone agreed that sharing turns made playing together special."
  },
  {
    "grade": 4,
    "passage_code": "G4-023",
    "title": "The Adventure of the Four Directions",
    "text": "One sunny morning, Maya and her brother Leo decided to explore the forest behind their house. Maya carried a small compass to help them find their way. \"Look,\" she said, \"the compass points north! We should start by heading north to find the big oak tree.\" As they walked north, they saw birds singing in the trees. After a while, they reached the oak tree. \"Now,\" Leo said, \"let's go east to find the sparkling stream.\" Following the compass east, they found the clear water flowing over the rocks. They played there for a bit before deciding to head south. \"The sun is setting in the west,\" Maya explained, \"so if we go south, we can circle back home.\" Using the directions north, south, east, and west helped Maya and Leo enjoy their adventure safely."
  },
  {
    "grade": 4,
    "passage_code": "G4-024",
    "title": "The Brave Mitten in Winter",
    "text": "In a small village, two mittens lay side by side on a wooden table. One mitten was old and soft, while the other was new and stiff. Both mittens wanted to help keep hands warm during the cold winter days. The old mitten was brave because it had already faced many cold mornings and snowy afternoons. It knew how to protect hands from the icy wind. The new mitten, although bright and clean, was unsure if it could be as brave. One snowy day, a small boy lost his mitten outside. The brave old mitten decided to leave the table and help the boy find it. The new mitten stayed behind, worried and unsure. In the end, the boy's lost mitten was found, but the brave old mitten showed that courage isn't about being new or perfect-it's about trying your best even in the coldest times."
  },
  {
    "grade": 4,
    "passage_code": "G4-025",
    "title": "How to Be a Good Loser in Sports",
    "text": "Losing a game can be hard, but it is an important part of playing sports. Being a good loser helps you learn and grow. Here are some steps to help you be a good loser: Step 1: Stay Calm. Take a deep breath and keep your cool. Getting upset will not help. Step 2: Say Good Game. Shake hands or say \"good game\" to your opponent. This shows respect. Step 3: Think About What You Learned. Every game teaches you something. Maybe you can practice a skill to get better next time. Step 4: Cheer for the Winner. Be happy for the team or player who won. This shows good sportsmanship. Step 5: Try Again. Remember, losing one game does not mean you cannot win the next. Keep playing and have fun!"
  },
  {
    "grade": 4,
    "passage_code": "G4-026",
    "title": "Sammy the Friendly Talking Squirrel",
    "text": "One sunny morning, Mia walked into the forest feeling sad because she lost her favorite hat. As she sat down on a rock, a squirrel suddenly jumped onto a branch and started talking! The squirrel said, \"Don't worry, Mia! I can help you find your hat.\" Because the squirrel could talk, Mia felt surprised but also hopeful. Sammy, the squirrel, used his sharp eyes to look around the trees. He quickly spotted something colorful caught in a bush. Mia ran over and found her hat! Because Sammy helped her, Mia was very happy and thanked him. From that day on, Mia visited the forest every morning to talk with Sammy. Their friendship grew because Sammy was kind and helpful. This made Mia feel less lonely and more confident during her walks. Thanks to Sammy's help, Mia learned that friends can be found in the most unexpected places."
  },
  {
    "grade": 4,
    "passage_code": "G4-027",
    "title": "Why Do Plants Need Water?",
    "text": "Lily: Hey, Max! Why do you think plants need water? Max: I think water helps them grow, but I'm not exactly sure how. Lily: Well, water is very important for plants. It helps carry nutrients from the soil into the plant. Max: Oh, so it's like plants drinking their food? Lily: Exactly! Water also keeps the plant cool and helps it make food through a process called photosynthesis. Max: Photosynthesis? What's that? Lily: It's how plants use sunlight, water, and air to make their own food and grow. Max: Wow! So without water, plants can't eat or stay healthy? Lily: That's right. Without enough water, plants wilt and may even die. Max: Now I understand why watering plants is so important! Lily: Yes! Taking care of plants means giving them enough water every day."
  },
  {
    "grade": 4,
    "passage_code": "G4-028",
    "title": "Story Time with Mom",
    "text": "Step 1: Find a cozy spot. Mom and I pick our favorite chair by the window. It has soft cushions and good light for reading. Step 2: Choose a book. We go to the bookshelf and pick a story about animals. I love stories with animals because they are fun and exciting. Step 3: Snuggle up. We sit close together so I can see the pictures clearly. Mom opens the book and starts reading. Step 4: Listen and imagine. As Mom reads, I close my eyes and picture the story in my mind. I imagine the animals playing and talking. Step 5: Talk about the story. After we finish, Mom asks me questions about the story. We talk about our favorite parts and what we learned. Story time is my favorite way to play because it helps me learn and spend time with Mom."
  },
  {
    "grade": 4,
    "passage_code": "G4-029",
    "title": "Making a Collage",
    "text": "Lila: Hey, Sam! Do you want to make a collage with me? Sam: That sounds fun! What do we need? Lila: We need old magazines, scissors, glue, and a big piece of paper. Sam: Great! I found some pictures of animals and trees. Lila: Perfect! I have some colorful shapes and flowers. Sam: How do we start? Lila: First, we cut out the pictures we like. Sam: Okay, I cut out a cute puppy and a tall tree. Lila: I cut out a bright sun and some stars. Sam: Now, let's glue them onto the paper. Lila: I like putting the sun at the top and the puppy near the tree. Sam: Me too! It looks like a happy day in the park. Lila: Making a collage is fun because we can use our imagination. Sam: I agree! Let's show it to our teacher tomorrow."
  },
  {
    "grade": 4,
    "passage_code": "G4-030",
    "title": "Making a Mini Book",
    "text": "Making a mini book is a fun way to learn and play at the same time. First, you need a few sheets of paper. Fold each sheet in half carefully. You can stack several folded sheets together to make the book thicker. Next, use a stapler or thread and needle to bind the folded edge, so the pages stay together. Now, you can start writing or drawing in your mini book! You can tell a story, write facts about animals, or create a comic. Coloring the pages makes it even more colorful and fun. Mini books are small, so you can carry them anywhere. They are great for sharing your stories with friends or family. Try making your own mini book today, and see how much fun playing and learning can be!"
  },
  {
    "grade": 4,
    "passage_code": "G4-031",
    "title": "How to Make a Compromise",
    "text": "Sometimes, you and a friend may want different things. Making a compromise means finding a solution that works for both of you. Here are some simple steps to help you make a compromise: Step 1: Listen carefully. Each person should say what they want and why it is important. Step 2: Think about the other person's ideas. Try to understand their feelings and needs. Step 3: Talk about possible solutions. Find ideas that could make both people happy. Step 4: Choose a solution that is fair to everyone. Remember, a good compromise means both sides give a little. Step 5: Try your solution and see how it works. If it doesn't work well, talk again and try a new compromise. Making a compromise helps people solve problems and stay friends. It is a useful skill for life!"
  },
  {
    "grade": 4,
    "passage_code": "G4-032",
    "title": "Rollerblading Safety Gear: Helmets vs. Knee Pads",
    "text": "Rollerblading is a fun sport that many kids enjoy. When you rollerblade, you need to wear safety gear to protect yourself. Two important pieces of gear are helmets and knee pads. Both protect you, but in different ways. Helmets protect your head. If you fall, your head can hit the ground hard. Wearing a helmet can stop serious injuries like bumps or cuts. Knee pads protect your knees. When you fall forward, your knees often hit the ground first. Knee pads help keep your knees from getting scrapes or bruises. Helmets are usually hard on the outside and soft inside to keep your head safe. Knee pads are soft with straps to hold them in place. Both are important because they protect different parts of your body. Using both a helmet and knee pads helps you stay safe and have more fun rollerblading!"
  },
  {
    "grade": 4,
    "passage_code": "G4-033",
    "title": "Thunder and Lightning Safety",
    "text": "Mom and Jake were watching a storm through the window. \"Mom, why do we see lightning before we hear thunder?\" Jake asked. Mom smiled, \"Lightning is a flash of light caused by electricity in the clouds. It travels faster than sound, so we see it first.\" Jake nodded, \"Is thunder dangerous?\" \"Thunder itself isn't dangerous,\" Mom explained. \"But it tells us that lightning is near. Lightning can be very dangerous, so we should stay indoors during a storm.\" Jake asked, \"What should I do if I'm outside and hear thunder?\" Mom said, \"You should go inside a building or a car right away. Avoid tall trees and water.\" Jake said, \"I will remember that! Stay safe during storms.\" Mom agreed, \"Yes, safety is the most important thing when we see thunder and lightning.\""
  },
  {
    "grade": 4,
    "passage_code": "G4-034",
    "title": "Carrying a Small Bag: Safe or Not?",
    "text": "Carrying a small bag can be very helpful, but it is important to use it safely. Some people carry their small bags on one shoulder. This can be quick and easy, but it might hurt your shoulder if the bag is heavy. Others carry the bag across their body with a long strap. This way, the bag feels more balanced and is less likely to fall off. When you carry a small bag on your back, it is like carrying a backpack. This can be good for your posture but might be too big if the bag is very small. A small bag can hold important things like keys, a wallet, or a phone. It is safer when the bag is zipped or closed tightly. This helps keep your things safe from falling out or being taken. In conclusion, carrying a small bag across your body is often safer and better for your body than just one shoulder or your back."
  },
  {
    "grade": 4,
    "passage_code": "G4-035",
    "title": "Warm and Cold: How Temperature Affects Us",
    "text": "Temperature tells us how warm or cold something is. When it is warm, things can melt or feel comfortable. When it is cold, water can turn into ice, and we might need to wear jackets. The sun is a natural source of heat. It warms the air, the ground, and everything around us. In cold places, like the North Pole, the sun's rays are weaker, so it stays cold most of the year. Warm places, like deserts, get strong sunlight and can become very hot during the day. Living things, including plants and animals, adapt to warm or cold environments. For example, polar bears have thick fur to stay warm, while desert plants store water to survive the heat. Understanding temperature helps us prepare for weather and take care of the world around us."
  },
  {
    "grade": 4,
    "passage_code": "G4-036",
    "title": "The Obstacle Course Challenge",
    "text": "\"Are you ready for the obstacle course?\" asked Mr. Lee, the gym teacher. \"Yes!\" said Mia, bouncing on her toes. \"I want to try the rope swing first.\" \"Okay,\" said Mr. Lee. \"Remember, safety first. Hold on tight and go slow at the climbing wall.\" Mia nodded and climbed carefully. \"Wow, this is harder than I thought!\" she said. \"Keep going, Mia! You're doing great!\" cheered her friend, Jake. Next, Mia reached the balance beam. \"Don't look down,\" Jake reminded her. Mia balanced slowly and made it across. \"You did it!\" Mr. Lee said with a smile. \"Now, the last part-the tire run!\" breathless but excited, Mia jumped through the tires one by one. \"That was fun! Can we do it again?\" she asked. \"Of course,\" said Mr. Lee. \"You all did an amazing job today!\""
  },
  {
    "grade": 4,
    "passage_code": "G4-037",
    "title": "Sam Learns About Hydration",
    "text": "Sam loved playing soccer after school. One sunny afternoon, his coach reminded the team to bring water bottles to practice. Sam didn't think much about it and forgot his water. During practice, Sam felt very thirsty and tired. He couldn't run as fast or kick the ball as hard as usual. After practice, his coach explained that when we play sports, our bodies lose water through sweat. If we don't drink enough water, we can feel weak and dizzy. The coach told Sam that drinking water before, during, and after practice helps keep us strong and ready to play. The next day, Sam remembered to bring his water bottle. He drank plenty of water and felt great while playing. Now, Sam knows that staying hydrated is just as important as practicing soccer skills!"
  },
  {
    "grade": 4,
    "passage_code": "G4-038",
    "title": "Packing a Backpack for an Adventure",
    "text": "Packing a backpack is an important skill for every young explorer. When you get ready for a trip or a day at school, you need to choose the right items to bring. First, think about what you will do. If you are going hiking, pack water, snacks, a map, and a jacket. If you are going to school, bring your books, pencil case, and lunch box. It is also important to pack things that will keep you safe and comfortable. For example, a hat and sunscreen can protect you from the sun. A small first aid kit can help if you get a scrape. Remember to pack neatly so everything fits and is easy to find. By packing your backpack carefully, you will be ready for any adventure or school day ahead!"
  },
  {
    "grade": 4,
    "passage_code": "G4-039",
    "title": "Why Playing Checkers Helps You Think",
    "text": "Playing checkers is a fun way to spend time, but it also helps your brain grow stronger. When you play, you have to think carefully about each move. This causes your mind to work hard, which improves your problem-solving skills. For example, if you jump over an opponent's piece, you gain an advantage. Because you want to win, you plan several moves ahead. This causes you to practice thinking about the future. As a result, playing checkers regularly can help you become better at making decisions. When you play with friends or family, you also learn how to be patient and wait for your turn. These skills are important not just in games but in school and life. So, playing checkers leads to stronger thinking and better social skills."
  },
  {
    "grade": 4,
    "passage_code": "G4-040",
    "title": "Helping with Recycling at Home",
    "text": "Recycling is important because it helps protect the Earth. When we recycle, we turn old materials into new ones instead of throwing them away. This saves natural resources like trees, water, and minerals. If people do not recycle, trash piles up in landfills, which can harm animals and pollute the environment. For example, plastic bottles can take hundreds of years to break down, causing damage to oceans and wildlife. By helping with recycling at home, children can make a big difference. When kids sort paper, plastic, and glass into the right bins, these materials can be reused. This reduces waste and helps keep the planet clean. Therefore, recycling causes less pollution and makes the Earth a better place to live. Everyone's efforts to recycle can protect nature and create a healthier world for the future."
  },
  {
    "grade": 4,
    "passage_code": "G4-041",
    "title": "Saving Money in a Jar: Two Ways to Save",
    "text": "Saving money is important, and many kids use jars to keep their coins safe. Some children save money to buy something special, like a toy or a game. They put all their coins in one jar and watch it grow. Other kids save money for the future, maybe for school supplies or a gift for someone. They might use two jars: one for spending soon and one for saving longer. The first way is simple and fun because you see your money add up quickly. The second way helps you plan better by keeping some money safe for later. Both ways teach good habits about money, but having two jars can help you think about different goals. Whether you use one jar or two, saving money helps you learn to be patient and careful with your coins."
  },
  {
    "grade": 4,
    "passage_code": "G4-042",
    "title": "Willie the Whale's Soft Songs",
    "text": "One sunny morning, Mia and her brother Tom stood on the beach, watching the ocean waves. Suddenly, they heard a gentle melody coming from the water. \"Do you hear that?\" Mia asked. \"It sounds like a song!\" Tom nodded, eyes wide. \"Let's see if we can find who's singing.\" They looked out and saw a huge whale swimming nearby. The whale's mouth opened and closed as soft, beautiful songs floated through the air. \"Hello, whale!\" Mia called gently. \"Are you singing to us?\" The whale sang a little louder, then seemed to smile. \"Yes, I am! My name is Willie. I sing soft songs to calm the sea and make friends.\" Tom grinned. \"Your songs are amazing, Willie. Can you teach us one?\" Willie sang a gentle tune, and soon Mia and Tom were humming along. They promised to visit often to hear Willie's soft songs and share their own stories."
  },
  {
    "grade": 4,
    "passage_code": "G4-043",
    "title": "How to Get Healthy Sleep",
    "text": "Getting healthy sleep is important for your body and mind. Here are some simple steps to help you sleep well every night. Step 1: Go to bed at the same time each night. This helps your body know when it is time to rest. Step 2: Turn off screens like TVs, tablets, and phones at least one hour before bedtime. The light from screens can make it hard to fall asleep. Step 3: Make your bedroom quiet, dark, and cool. These conditions help your body relax and get ready for sleep. Step 4: Avoid eating or drinking too much before bed, especially sugary snacks and drinks. Step 5: Try to relax before bed by reading a book or listening to calm music. Following these steps can help you get the healthy sleep you need to feel good and grow strong."
  },
  {
    "grade": 4,
    "passage_code": "G4-044",
    "title": "The Helpful Wizard",
    "text": "In a small village lived two wizards. One was named Max, and the other was named Felix. Max only knew helpful spells. For example, he could make flowers grow quickly or help lost animals find their way home. Felix, on the other hand, knew many powerful spells, but some of them could be tricky or even a little scary. Max's spells were simple and safe. When he helped people, they smiled and felt happy. Felix's spells sometimes caused surprises. Once, he made a big storm appear, but he quickly changed it into sunshine. Both wizards wanted to help, but Max always chose spells that made things better without any risk. While Felix's magic was exciting and strong, Max's magic was calm and kind. The villagers loved Max because his spells were always helpful and never caused trouble. In the end, both wizards showed that magic could be used in different ways, but helpful spells made the world a nicer place."
  },
  {
    "grade": 4,
    "passage_code": "G4-045",
    "title": "Running a Lap Around the Track",
    "text": "One sunny morning, Mia and her friends went to the school track for gym class. Today, they were going to run a lap around the track. Mia felt a little nervous because she had never run a full lap before. Mrs. Lee, their coach, explained that a lap is one complete circle around the track. She told them to start slow and save their energy for the last part. When the whistle blew, Mia began running. At first, she kept a steady pace. Halfway through, she felt tired but remembered Mrs. Lee's advice. She took a deep breath and ran faster toward the finish line. When Mia crossed the finish line, she felt proud and happy. She learned that running a lap was challenging but fun. Mia looked forward to running again next week!"
  },
  {
    "grade": 4,
    "passage_code": "G4-046",
    "title": "Learning a Simple Song",
    "text": "One sunny afternoon, Mia and her friends gathered in the park. They wanted to learn a new song to sing during their school play. Mia's teacher had given them a simple song about animals. It was easy to remember because it had a fun rhythm and repeated words. First, Mia listened carefully as her teacher sang the song once. Then, the friends sang it together slowly. At first, some words were tricky, but they helped each other remember. They practiced the song again and again, laughing when someone made a mistake. By the end of the afternoon, Mia and her friends sang the entire song perfectly. They felt proud and happy. Learning the song was fun because they played and practiced together. Mia couldn't wait to sing it in front of the class!"
  },
  {
    "grade": 4,
    "passage_code": "G4-047",
    "title": "How to Make a Birthday Card",
    "text": "Making a birthday card is a fun way to show someone you care. First, gather your materials. You will need paper, crayons or markers, scissors, glue, and some decorations like stickers or glitter. Next, fold a piece of paper in half to create the card. Then, think about the person's favorite colors or things they like. Use your crayons or markers to draw pictures or write a special message on the front of the card. After that, add decorations to make your card bright and cheerful. You can also write a note inside to tell them why they are special. Finally, let any glue or glitter dry before giving the card to your friend or family member. Making a card by hand is a great way to celebrate a birthday and make someone smile."
  },
  {
    "grade": 4,
    "passage_code": "G4-048",
    "title": "Goalkeeper Basics with Coach Lee",
    "text": "Coach Lee: \"Hi, Mia! Are you ready to learn about being a soccer goalkeeper?\" Mia: \"Yes! I want to know how to stop the ball and keep the team safe.\" Coach Lee: \"Great! First, a goalkeeper needs to watch the ball closely at all times. This helps you know where it's going.\" Mia: \"Okay, watch the ball. What else?\" Coach Lee: \"Positioning is very important. Stand in the middle of the goal so you can reach both sides quickly.\" Mia: \"Got it! What about catching the ball?\" Coach Lee: \"Use your hands to catch or block the ball. Keep your fingers strong and your eyes on the ball. If you can't catch it, try to push it away from the goal.\" Mia: \"That sounds fun! I want to practice every day.\" Coach Lee: \"Awesome! Remember, being a good goalkeeper takes practice and confidence. Keep trying, and you'll do great!\""
  },
  {
    "grade": 4,
    "passage_code": "G4-049",
    "title": "Why Does a Puddle Disappear?",
    "text": "Have you ever noticed that after it rains, small puddles form on the ground? But if you check the same spot a few hours later, the puddle might be gone! This happens because of a process called evaporation. When the sun shines, it warms the water in the puddle. The heat gives the water molecules energy to turn from liquid into invisible water vapor, which rises into the air. This means the water slowly disappears from the puddle, even though it hasn't soaked into the ground. If the day is hot and sunny, puddles evaporate faster. On cooler or cloudy days, evaporation happens more slowly. So, the main reason a puddle disappears is because the sun's heat causes the water to evaporate and turn into vapor that floats away into the sky."
  },
  {
    "grade": 4,
    "passage_code": "G4-050",
    "title": "Why Being a Good Friend Matters",
    "text": "Being a good friend is important because it helps everyone feel happy and cared for. When you listen to your friends, they feel understood and trusted. This makes them want to be kind and helpful in return. For example, if you share your toys, your friends will feel special and want to share with you too. When friends are kind to each other, they can solve problems more easily. They don't want to fight because they know being friends is more important. Also, good friends help each other in tough times. If someone feels sad, a good friend will try to cheer them up. This support makes friends feel safe and loved. So, being a good friend causes happiness and trust, which makes friendships stronger and more fun for everyone."
  },
  {
    "grade": 4,
    "passage_code": "G4-051",
    "title": "Why Leaves Change Color",
    "text": "Have you ever wondered why leaves change color in the fall? Leaves are usually green because they contain a special chemical called chlorophyll. Chlorophyll helps leaves make food for the tree by capturing sunlight. During spring and summer, leaves are full of chlorophyll, which is why they look green. But when fall comes, the days get shorter and cooler. Trees get ready for winter by stopping the food-making process. The chlorophyll breaks down and disappears, revealing other colors like yellow, orange, and red. These colors were already in the leaves but hidden by the green. This is why we see beautiful fall colors before the leaves fall off the trees. So, the next time you see colorful leaves, remember it is all because the tree is preparing for winter!"
  },
  {
    "grade": 4,
    "passage_code": "G4-052",
    "title": "The Button Sorting Game",
    "text": "One rainy afternoon, Mia found a box full of colorful buttons in her grandma's attic. The buttons were all mixed up-red, blue, yellow, green, and purple. Mia decided to sort them by color. She spread the buttons out on the table and started picking out all the red ones first. After placing them in a small bowl, she moved on to the blue buttons. Sorting the buttons made Mia feel like she was playing a fun game. As she worked, she counted how many buttons were in each color group. When she finished, she had five piles of buttons, each a different color. Mia felt proud of her work and asked her grandma if they could sew some buttons on a blanket. Sorting buttons turned out to be both fun and useful!"
  },
  {
    "grade": 4,
    "passage_code": "G4-053",
    "title": "Listening to the Coach: Two Ways to Play",
    "text": "In sports, listening to the coach can make a big difference in how you play the game. Some players pay close attention to every word the coach says. They follow the instructions carefully, practicing new skills and trying different strategies. These players often improve quickly because they learn from the coach's advice. On the other hand, some players like to do things their own way. They may not listen as much and prefer to rely on what they already know. While these players can have fun and show creativity, they might miss important tips that could help them and their team win. Both ways have benefits, but players who listen to their coach usually find it easier to work with their team and get better at the sport. So, next time you play, try listening closely-you might surprise yourself!"
  },
  {
    "grade": 4,
    "passage_code": "G4-054",
    "title": "Button Art Fun",
    "text": "Lily: \"Look at my button art, Max! I made a colorful butterfly.\" Max: \"Wow, Lily! How did you do that?\" Lily: \"I glued different buttons onto a piece of paper. Each button is a different color and size.\" Max: \"That's cool! Can I try?\" Lily: \"Sure! Here are some buttons and glue. You can make anything you want.\" Max: \"I think I'll make a button car!\" Lily: \"Great idea! Button art is fun because you can use your imagination and create many shapes.\" Max: \"I like how the buttons feel round and smooth. It's like a puzzle!\" Lily: \"Yes! And when you finish, you have a beautiful picture made with buttons.\" Max: \"I can't wait to show my button car to my family!\" Lily: \"Me too! Button art is a fun way to play and be creative.\""
  },
  {
    "grade": 4,
    "passage_code": "G4-055",
    "title": "Daisy, the Tiny Dragon Who Loved Quiet",
    "text": "In a peaceful forest lived Daisy, a tiny dragon no bigger than a squirrel. Unlike other dragons, Daisy did not roar loudly or breathe fire to scare others. Instead, she loved quiet and gentle sounds. Whenever the wind whispered through the leaves or birds sang softly, Daisy felt happy and calm. One sunny day, a loud thunderstorm scared Daisy. The booming thunder made her shiver, and she wished for silence. After the storm, Daisy decided to build a cozy den deep inside a cave where she could rest peacefully. She lined it with soft moss and petals, making it warm and quiet. Daisy loved to explore the calm parts of the forest, where she could listen to the gentle rustle of the trees. Even though she was small, Daisy taught everyone that being gentle and loving quiet could be very special too."
  },
  {
    "grade": 4,
    "passage_code": "G4-056",
    "title": "Music Lesson Day",
    "text": "Ms. Lee: Good morning, everyone! Are you ready for our music lesson today? Tom: Yes, Ms. Lee! I love music class. Ms. Lee: Today, we will learn how to play the recorder. Has anyone tried it before? Emma: I tried it once, but I didn't know how to make a sound. Ms. Lee: That's okay, Emma. It takes practice. First, hold the recorder like this and cover the holes with your fingers. Tom: Like this? Ms. Lee: Yes, perfect! Now, blow gently into the mouthpiece. Emma: I can hear a sound! Ms. Lee: Great job! Music helps us express our feelings and have fun together. Tom: I think I want to learn more songs on the recorder. Ms. Lee: Wonderful! Next week, we will practice a simple song. Keep practicing at home!"
  },
  {
    "grade": 4,
    "passage_code": "G4-057",
    "title": "Dance Class Coordination: Ballet vs. Hip-Hop",
    "text": "Dance classes help kids learn coordination, but different styles use coordination in unique ways. In ballet, dancers focus on graceful movements and precise positions. They must keep their balance while moving slowly and smoothly. Coordination in ballet means controlling every part of the body carefully. In hip-hop dance, coordination is also important, but the movements are faster and more energetic. Dancers use sharp, quick actions and often move to the beat of the music. Hip-hop requires coordination between arms, legs, and even facial expressions. Both ballet and hip-hop teach dancers to work as a team during group performances. While ballet emphasizes elegance and control, hip-hop focuses on rhythm and energy. Learning either style can improve coordination, but the way dancers move and express themselves is very different."
  },
  {
    "grade": 4,
    "passage_code": "G4-058",
    "title": "A Friendly Alien at the Playground",
    "text": "One sunny afternoon, Mia and her friends were playing at the playground when they saw something unusual. A small, green alien with big eyes and a friendly smile was sitting on the swings. The alien looked different from the other kids, but it wanted to have fun just like them. Mia noticed that the alien loved swinging high in the air, just like she did. However, unlike the children, the alien could jump really far and even float a little before landing. While the children played tag by running fast, the alien floated gently above the ground to catch them. Even though the alien was not from their world, it enjoyed playing the same games. Mia and her friends learned that being different was okay, and having a friendly alien at the playground made their playtime even more exciting."
  },
  {
    "grade": 4,
    "passage_code": "G4-059",
    "title": "Why Sleep Is Important",
    "text": "Mom: Hey, Jamie! Do you know why getting enough sleep is important? Jamie: Not really. I just know I feel tired when I don't sleep well. Mom: That's true! Sleep helps your body rest and your brain get ready for a new day. Jamie: So, what happens if I don't sleep enough? Mom: If you don't sleep enough, you might feel cranky and have trouble paying attention at school. Jamie: Oh! I want to do well in school. How many hours should I sleep? Mom: Kids your age need about 9 to 11 hours of sleep every night. Jamie: Wow, that's a lot! What can I do to sleep better? Mom: Try to go to bed at the same time every night and keep your room quiet and dark. Jamie: I will! Thanks, Mom. I want to be healthy and ready to learn!"
  },
  {
    "grade": 4,
    "passage_code": "G4-060",
    "title": "The Kite That Found a Friend",
    "text": "One windy afternoon, a bright red kite named Ruby soared high above the park. \"Hello down there!\" Ruby called to the children playing below. A little boy named Max looked up and waved. \"Hi, Ruby! Want to play with me?\" he shouted. Ruby twirled happily. \"Yes! But I can't come down. Can you fly a kite like me?\" Max smiled. \"I'm learning!\" Suddenly, the wind pushed Ruby closer to a blue kite stuck in a tree. \"Oh no!\" Ruby exclaimed. \"Can you help me?\" The blue kite replied, \"I'm stuck and scared.\" Max ran over and carefully untangled the kite. \"There you go!\" he said. \"Now you two can be friends in the sky!\" Ruby and the blue kite danced in the wind together. \"Thanks for helping, Max,\" Ruby said. \"We found a new friend today!\""
  },
  {
    "grade": 4,
    "passage_code": "G4-061",
    "title": "The Giggle Spell",
    "text": "One sunny afternoon, Lily found an old, dusty book in her grandmother's attic. The book was filled with magic spells! Curious, Lily read a spell called \"The Giggle Spell.\" It said that if you say the words \"Tickle-Tickle, Laugh and Play,\" everyone around you would start giggling uncontrollably. Excited, Lily decided to try it at school the next day. During recess, she whispered the spell quietly. Suddenly, her classmates began to giggle and laugh, even the grumpy teacher couldn't help but smile! The playground was filled with happy sounds. Lily realized the spell was safe and fun. From that day on, whenever someone felt sad or tired, Lily would say the magic words, and soon everyone was giggling again. The giggle spell brought joy and friendship wherever it went!"
  },
  {
    "grade": 4,
    "passage_code": "G4-062",
    "title": "Comparing Different Flower Parts",
    "text": "Flowers are important parts of many plants. They help plants make seeds so new plants can grow. Although all flowers have some common parts, there are differences between them. Most flowers have petals, which can be bright and colorful. These petals attract insects like bees and butterflies. Another part is the stamen, which produces pollen. The pollen is needed to make seeds. Some flowers have many stamens, while others have only a few. Inside the flower is the pistil, which collects pollen and helps seeds form. Some flowers have a single pistil, and others have several. Finally, flowers have sepals that protect the flower before it opens. In roses, sepals are green and leaf-like. In tulips, sepals look very similar to petals. By comparing these parts, we can see how flowers are alike and different, helping them survive in many environments."
  },
  {
    "grade": 4,
    "passage_code": "G4-063",
    "title": "Building a Tall Tower",
    "text": "One sunny afternoon, Mia and her friends decided to build a tall tower with blocks. They wanted to see how high they could stack the blocks without it falling over. Because the blocks at the bottom were strong and wide, the tower stayed steady. However, as they added more blocks on top, the tower became wobbly and started to lean. The tower fell because the blocks at the top were not balanced well. Mia learned that if the base is not strong, the tower will not stand for long. So, they decided to build a wider base first. This made the tower more stable, and they were able to build it taller. Playing and building the tower taught them that a strong foundation causes a tall and steady tower to stand."
  },
  {
    "grade": 4,
    "passage_code": "G4-064",
    "title": "The Power of Saying Sorry",
    "text": "Sometimes, people make mistakes that hurt others, even if they don't mean to. When this happens, saying sorry is very important. For example, if a friend accidentally breaks your toy, they might feel bad and say sorry. This apology shows they understand their mistake. When you hear the apology, you might feel upset at first. But accepting the apology can help you both feel better. It can make your friendship stronger because it shows you both care about each other's feelings. On the other hand, if you don't accept the apology, the upset feelings can stay longer and cause more problems. So, when someone says sorry, accepting it can help everyone move on and be happy again. This is why accepting an apology is a kind and helpful thing to do in life."
  },
  {
    "grade": 4,
    "passage_code": "G4-065",
    "title": "How Wind Causes Erosion",
    "text": "Erosion is the process by which soil and rock are moved from one place to another. Wind erosion happens when strong winds blow loose dirt and sand away. This is common in places like deserts and dry fields where plants don't grow well to hold the soil in place. When wind picks up tiny particles of soil, it can carry them over long distances. This can change the shape of the land, creating hills or even small dunes made of sand. Wind erosion can also cause problems by removing the top layer of soil, which plants need to grow. Farmers try to stop wind erosion by planting trees or grass that act as windbreaks. These plants help keep the soil from blowing away and protect the land. Understanding wind erosion helps us take care of our environment better."
  },
  {
    "grade": 4,
    "passage_code": "G4-066",
    "title": "Setting the Table: A Helpful Life Skill",
    "text": "Setting the table is an important skill that helps everyone at mealtime. It means putting plates, forks, knives, spoons, cups, and napkins in the right places. First, place the plate in the center of each seat. Then, put the fork on the left side of the plate. The knife goes on the right side, with the blade facing the plate. Next to the knife, place the spoon. A cup or glass should be set above the knife, near the top right of the plate. Finally, fold a napkin and put it either on the plate or to the left of the fork. Setting the table correctly helps meals run smoothly and shows respect for everyone eating. It is also a way for children to help their family and learn responsibility."
  },
  {
    "grade": 4,
    "passage_code": "G4-067",
    "title": "Floating in the Water: Back Float vs. Front Float",
    "text": "Swimming lessons teach kids many skills, including how to float. Two common types of floating are the back float and the front float. When you do a back float, you lie on your back in the water and relax. Your face stays above the water, and you can breathe easily. This position helps you rest if you get tired while swimming. On the other hand, the front float means lying face down in the water. You stretch your arms forward and keep your body straight. This helps swimmers practice holding their breath and kicking their legs. Both floats help swimmers stay safe in the water. While the back float lets you rest and breathe, the front float prepares you to swim longer distances. Learning to float in both ways is important for every swimmer."
  },
  {
    "grade": 4,
    "passage_code": "G4-068",
    "title": "First Day in a New Class",
    "text": "Ms. Lee: Good morning, everyone! Today, we have a new student joining us. This is Mia. Tom: Hi Mia! Welcome to our class. What do you like to do for fun? Mia: Hi Tom! I like drawing and playing soccer. How about you? Tom: I love soccer too! Maybe we can play together sometime. Ms. Lee: That sounds like a great idea! Mia, do you know anyone in this school? Mia: Not really, but I hope to make new friends. Lily: You will! We have a club that meets after school. You can join us. Mia: Thanks, Lily! I'm a little nervous, but you all seem very kind. Ms. Lee: That's wonderful to hear, Mia. Everyone, let's make sure Mia feels welcome. Today, we'll also do some group activities to help us get to know each other better. Mia: I'm excited to start. Thank you, everyone!"
  },
  {
    "grade": 4,
    "passage_code": "G4-069",
    "title": "Kitchen Pretend Baking: Real vs. Play",
    "text": "Pretend baking in the kitchen is a fun way to use your imagination. When you bake for real, you use ingredients like flour, sugar, and eggs. You follow a recipe carefully and turn on the oven to bake cookies or cakes. The kitchen smells delicious, and you have to be careful not to burn yourself. In pretend baking, you don't need real ingredients or heat. Instead, you use toy utensils, plastic food, or even play dough to make your treats. You can mix and shape anything you want without worrying about recipes or ovens. Both real and pretend baking can be enjoyable, but one is messy and needs grown-up help, while the other is clean and safe to do alone. Whether you bake for real or pretend, both ways let you have fun and learn how baking works. You can imagine being a chef, create new recipes, and share your treats with family or friends."
  },
  {
    "grade": 4,
    "passage_code": "G4-070",
    "title": "Listening to the Coach: Two Ways to Learn in Sports",
    "text": "In sports, listening to the coach is very important. Some players learn by following every instruction the coach gives. They pay close attention and practice exactly what the coach shows them. These players improve quickly because they understand what the coach wants. Other players like to try things their own way first. They listen to the coach but also use their own ideas during practice. Sometimes this helps them find new moves or skills. However, they might make more mistakes and take longer to improve. Both ways have good points. Listening carefully to the coach can help players get better faster. Trying your own way can help you be creative and confident. The best players often do both: they listen well and then add their own style to the game."
  },
  {
    "grade": 4,
    "passage_code": "G4-071",
    "title": "Learning to Dribble a Basketball",
    "text": "Tom was excited to join his school's basketball team. On the first day of practice, Coach Lee showed the players how to dribble the ball. Dribbling means bouncing the basketball up and down while moving. At first, Tom found it hard to keep the ball under control. It would bounce too far away, or he would stop moving. Coach Lee told him to keep his eyes up and use his fingertips, not his palm, to bounce the ball. Tom practiced every day after school. Slowly, he got better and could dribble quickly while running. Soon, Tom was able to pass the ball to his teammates and even make some baskets. Dribbling was not easy at first, but with practice, Tom learned how to play basketball better and have more fun on the court."
  },
  {
    "grade": 4,
    "passage_code": "G4-072",
    "title": "The Day the Sun Felt Warm",
    "text": "One chilly morning, Mia and her brother, Leo, decided to explore their backyard. The air was cold, and they could see their breath like tiny clouds. Mia wore her warm jacket, while Leo had a thin sweater. As they walked, the sun slowly rose higher in the sky. Mia noticed that the sunlight felt warmer on her face. \"Why does the sun feel warm now?\" she asked Leo. Leo remembered what their teacher said: \"The sun's rays carry energy that warms the earth. When the sun is low, the light is weak and the air feels cold. But when the sun is high, it shines stronger and makes things warm.\" They both smiled, feeling the sun's warmth chase away the cold. It was a wonderful lesson about how warm and cold change during the day."
  },
  {
    "grade": 4,
    "passage_code": "G4-073",
    "title": "How to Dribble a Basketball",
    "text": "Dribbling is an important skill in basketball. It helps you move with the ball and keep it away from defenders. Here are the steps to dribble a basketball correctly. First, stand with your feet shoulder-width apart and bend your knees slightly. This helps you stay balanced. Second, use your fingertips to push the ball down to the floor. Avoid using your palm because it's harder to control the ball that way. Third, keep your eyes up and look ahead, not at the ball, so you can see what's happening on the court. Fourth, practice dribbling with both your right and left hands. This will make you a better player. Finally, try to keep the ball low and close to your body to protect it from defenders. With practice, you will dribble confidently and help your team score points!"
  },
  {
    "grade": 4,
    "passage_code": "G4-074",
    "title": "A Fun Spot-the-Difference Game",
    "text": "Lily and Max were bored on a rainy afternoon. \"Let's play a spot-the-difference game!\" said Lily. Max nodded happily. Lily took out two pictures from her book. \"Look at these two pictures,\" she said. \"Can you find five differences between them?\" Max looked closely. \"Hmm, the tree is taller in the first picture,\" he said. \"And the boy is wearing a red hat in the second picture,\" Lily added. They went back and forth, finding small changes like missing flowers and different colors. \"This is fun!\" Max exclaimed. \"I didn't notice the dog's tail was shorter,\" Lily laughed. After finding all the differences, they decided to make their own spot-the-difference pictures. \"Playing this game makes me notice details better,\" Max said. \"Me too,\" Lily agreed. They smiled, happy to have found a fun way to play inside on a rainy day."
  },
  {
    "grade": 4,
    "passage_code": "G4-075",
    "title": "Anna's Origami Adventure",
    "text": "Anna loved to play with paper. One day, her teacher showed the class how to make easy origami shapes. Origami is the art of folding paper to create fun designs. Anna started with a simple paper boat. She folded the paper carefully, making sharp edges and smooth creases. When she finished, her boat could float in water! Next, Anna tried making a paper hat. It was a bit tricky, but she followed the steps slowly. Soon, she had a colorful hat to wear. Anna felt proud because she learned how to turn a flat sheet of paper into something new and exciting. She decided to make more origami shapes at home and share them with her friends. Playing with origami helped Anna use her hands and imagination. It was a fun way to learn and play at the same time."
  },
  {
    "grade": 4,
    "passage_code": "G4-076",
    "title": "How to Jump Rope Singles",
    "text": "Jump rope singles is a fun and simple way to enjoy jumping rope. Follow these easy steps to get started. First, find a jump rope that is the right length for you. Stand on the middle of the rope and pull the handles up to your armpits. Next, hold the handles firmly in each hand and swing the rope over your head and under your feet. Now, jump once as the rope comes underneath you. Try to land softly on the balls of your feet. Keep your elbows close to your sides and use your wrists to swing the rope, not your whole arms. Practice jumping once with each turn of the rope. As you get better, try to jump faster and longer without stopping. Remember to wear comfortable shoes and jump on a flat surface. With practice, you can enjoy jump rope singles and stay active and healthy!"
  },
  {
    "grade": 4,
    "passage_code": "G4-077",
    "title": "The Friendly Talking Squirrel",
    "text": "One sunny morning, Mia was walking through the forest when she heard a tiny voice. \"Hello!\" the voice said. Mia looked around and saw a small squirrel sitting on a branch. To her surprise, the squirrel smiled and said, \"I'm Sammy, the talking squirrel!\" Sammy told Mia that he loved making new friends and helping animals find food. Mia and Sammy spent the day exploring the forest together. Sammy showed Mia secret places where the juiciest nuts grew. They laughed and shared stories until the sun began to set. Before Mia left, Sammy promised to always be her friend and talk to her whenever she visited the forest. Mia felt happy knowing she had a special friend who could talk and understand her. From that day on, Mia and Sammy met often to share adventures and fun."
  },
  {
    "grade": 4,
    "passage_code": "G4-078",
    "title": "Why Do Boats Float?",
    "text": "Sam: Hey Mia, have you ever wondered why boats don't sink in the water? Mia: Yes! Boats are so big, but they stay on top of the water. How does that happen? Sam: It's all about something called buoyancy. When a boat is placed in water, it pushes some water out of the way. Mia: So, the boat pushes water aside? What happens then? Sam: The water pushes back with an upward force, called buoyant force. If this force is strong enough to hold the boat's weight, the boat floats! Mia: Oh, so the shape of the boat helps it push water away? Sam: Exactly! Boats are shaped to spread out their weight and push enough water away to stay afloat. Mia: That's cool! So, it's like the water is holding the boat up. Sam: Yes! That's why even heavy boats can float, as long as they push away enough water."
  },
  {
    "grade": 4,
    "passage_code": "G4-079",
    "title": "Soccer Goalkeeper Basics",
    "text": "In soccer, the goalkeeper has a very important job. They guard the goal to stop the other team from scoring. Goalkeepers wear special gloves to help them catch and block the ball. They also wear a different colored jersey so everyone knows who the goalkeeper is. When the ball comes toward the goal, the goalkeeper must be quick and ready to jump, dive, or catch the ball. Good goalkeepers watch the players carefully and try to guess where the ball will go. They use their hands, feet, and body to stop the ball from going into the net. Being a goalkeeper takes practice, good reflexes, and bravery because sometimes the ball comes very fast. Many goalkeepers also help their team by telling players where to stand and when to defend. This helps the whole team play better and stop the other team from scoring."
  },
  {
    "grade": 4,
    "passage_code": "G4-080",
    "title": "Cleaning Up Toys: A Simple Way to Help",
    "text": "Cleaning up toys is an important part of daily life. When you finish playing, putting your toys away keeps your room neat and safe. It helps you find your toys easily next time. Cleaning up also teaches responsibility. Responsibility means taking care of your things and your space. Many families have a special place for toys, like a shelf or a box. You can sort toys by type, such as cars, dolls, or blocks. This makes cleaning up faster and more fun. Sometimes, cleaning up toys can be a game. You might race to see who can put away the most toys. Helping with cleaning shows kindness because it makes the home better for everyone. Remember, cleaning up toys is a small task that makes a big difference every day!"
  },
  {
    "grade": 4,
    "passage_code": "G4-081",
    "title": "The Leaf That Wanted to Fly",
    "text": "\"Look at me!\" said the little green leaf, trembling on the branch. \"I want to ride the wind and see the world!\" The old oak tree smiled. \"Be patient, little one. When the wind is just right, you'll fly far and wide.\" One breezy afternoon, the wind began to blow harder. \"Now's your chance!\" whispered a nearby bird. The leaf let go and floated gently into the air. \"Wow!\" it cried. \"I can see the river, the hills, and even the tiny ants below!\" Suddenly, the wind pushed it higher. \"Hold on tight!\" it said. The leaf danced and twirled, feeling free and happy. Eventually, the leaf landed softly on a child's hand. \"You're beautiful!\" the child said. The leaf smiled, proud to have ridden the wind and made a new friend."
  },
  {
    "grade": 4,
    "passage_code": "G4-082",
    "title": "Why We Go to the Grocery Store",
    "text": "We go to the grocery store because we need food to eat. When our refrigerator is empty or nearly empty, we have to buy more fruits, vegetables, and other items. If we do not go to the store, we might not have enough food to cook meals at home. Also, when we plan a special dinner, we need to get specific ingredients that we don't have. Going to the grocery store causes us to have fresh food, which helps us stay healthy and strong. If we wait too long to shop, some foods might spoil, and then we have to throw them away. Therefore, regularly visiting the grocery store causes us to save money and avoid waste. In short, going to the grocery store is important because it causes us to have the food we need every day."
  },
  {
    "grade": 4,
    "passage_code": "G4-083",
    "title": "Why Soap Cleans",
    "text": "Have you ever wondered why soap cleans your hands so well? Let's learn the steps! Step 1: When your hands are dirty, tiny bits of oil and germs stick to your skin. Step 2: Soap has special ingredients called molecules. These molecules have two ends: one that loves water and one that loves oil. Step 3: When you rub soap on your hands, the soap molecules surround the oil and dirt. Step 4: The oil-loving end sticks to the dirt, and the water-loving end sticks to water. Step 5: When you rinse your hands, the soap carries the dirt and germs away with the water. Step 6: Your hands become clean and fresh! So, soap works like a helper that grabs dirt and washes it off. Now you know why washing with soap is important to stay healthy!"
  },
  {
    "grade": 4,
    "passage_code": "G4-084",
    "title": "How Fish Use Gills to Breathe",
    "text": "Fish live in water, but they still need oxygen to survive. Unlike humans, fish do not have lungs. Instead, they use special body parts called gills to breathe. Gills are located on the sides of a fish's head. When a fish opens its mouth, water flows in and passes over the gills. The gills take oxygen out of the water and send it into the fish's blood. Because water has less oxygen than air, fish need to keep water moving over their gills constantly. If water does not flow, the fish cannot get enough oxygen and may suffocate. This is why many fish must keep swimming to breathe. In summary, fish use their gills to get oxygen from water, and the movement of water over the gills causes the fish to breathe."
  },
  {
    "grade": 4,
    "passage_code": "G4-085",
    "title": "Our Family Pizza Night",
    "text": "Every Friday night, my family has a special tradition called Pizza Night. First, we all gather in the kitchen to make the pizza dough. My mom mixes the flour, water, and yeast while my dad kneads the dough. Next, we roll the dough out into a big circle on the table. Then, everyone adds their favorite toppings. I like pepperoni and cheese, while my little sister adds olives and mushrooms. After the toppings are ready, my dad puts the pizza in the oven to bake. While we wait, we set the table and talk about our week. Finally, when the pizza is golden and hot, we all sit down together to eat and enjoy our delicious creation. Pizza Night is my favorite family tradition because it brings us closer and tastes amazing!"
  },
  {
    "grade": 4,
    "passage_code": "G4-086",
    "title": "How Screws Are Different From Nails",
    "text": "Screws and nails are both simple machines used to hold objects together, but they work in different ways. A nail is a straight piece of metal that you hit with a hammer to push it into wood or other materials. It relies on force to stay in place. A screw, however, has spiral ridges called threads that wrap around its shaft. When you turn a screw with a screwdriver, the threads pull the screw deeper into the material. This makes screws stronger than nails at holding things tightly. While nails can be removed by pulling them out, screws can be unscrewed and reused. Both nails and screws help us build things, but screws use a twisting motion and threads to hold better, while nails depend on being hammered in straight."
  },
  {
    "grade": 4,
    "passage_code": "G4-087",
    "title": "What Are Echoes?",
    "text": "An echo is a sound that bounces back to you after hitting a surface. When you shout near a big wall or a mountain, the sound waves travel through the air, hit the surface, and then reflect back. This reflected sound is what you hear as an echo. Echoes happen because sound moves in waves and can bounce off hard objects. The time it takes for the echo to come back depends on how far away the surface is. For example, if you shout in a large cave, you might hear your own voice echoing several times! Many animals, like bats and dolphins, use echoes to find their way or locate food. This is called echolocation. Echoes are not only fun to hear but also help us learn about sound and how it travels."
  },
  {
    "grade": 4,
    "passage_code": "G4-088",
    "title": "How Soil Layers Affect Plant Growth",
    "text": "Soil has different layers that affect how plants grow. The top layer, called the topsoil, contains many nutrients and helps plants get the food they need. If the topsoil is healthy, plants can grow strong. Below the topsoil is the subsoil. This layer has fewer nutrients and is made of clay and minerals. If plants' roots cannot reach enough nutrients in the topsoil, they may grow poorly because the subsoil does not provide enough food. The bottom layer is bedrock, which is hard and solid. Roots cannot grow through bedrock, so plants rely on the layers above it for water and nutrients. Because of these layers, farmers must take care of the topsoil to ensure their crops grow well. If the topsoil washes away, plants will not get enough nutrients, which causes poor growth."
  },
  {
    "grade": 4,
    "passage_code": "G4-089",
    "title": "A Good Bedtime Routine",
    "text": "Having a good bedtime routine helps you sleep better and feel great the next day. First, it is important to finish dinner at least one hour before going to bed. This gives your body time to digest food. Next, brush your teeth carefully to keep them clean and healthy. After brushing, put on your pajamas and tidy up your room. A neat room helps you feel calm and ready for sleep. Then, read a book or listen to a quiet story. This relaxes your mind. Finally, turn off bright lights and say goodnight to your family. Try to go to bed at the same time each night so your body gets used to a schedule. Following these steps every night will help you sleep well and wake up feeling happy and strong."
  },
  {
    "grade": 4,
    "passage_code": "G4-090",
    "title": "The Water Cycle Adventure",
    "text": "Anna and Ben were sitting by the pond when Anna asked, \"Ben, do you know where the water in this pond comes from?\" Ben thought for a moment and said, \"Maybe it rains and fills the pond?\" \"That's right!\" Anna smiled. \"But the water doesn't just stay here. It moves around all the time in something called the water cycle.\" \"How does that work?\" Ben was curious. \"Well,\" Anna explained, \"the sun heats up the water and turns it into vapor. This is called evaporation. The vapor rises into the sky and forms clouds, which is condensation. Later, the water falls back to the ground as rain or snow-that's precipitation.\" Ben nodded, \"So the water keeps moving, changing from liquid to vapor to solid and back again?\" \"Exactly!\" Anna said. \"That's why the water in the pond is always fresh and never runs out!\""
  },
  {
    "grade": 4,
    "passage_code": "G4-091",
    "title": "How to Do a Safe Gymnastics Forward Roll",
    "text": "A forward roll is a fun gymnastics move that helps you learn balance and control. To do a safe forward roll, follow these steps. First, start by standing with your feet shoulder-width apart. Next, squat down and place your hands flat on the floor in front of you. Make sure your fingers are spread out to support your weight. Then, tuck your chin to your chest to protect your head and neck. Slowly push off with your feet and roll forward over your head and back. Keep your body tight and rounded as you roll. Finally, land on your feet and stand up straight. Remember, always practice on a soft mat and ask an adult or coach to watch for safety. Practicing these steps helps you enjoy gymnastics safely!"
  },
  {
    "grade": 4,
    "passage_code": "G4-092",
    "title": "Getting a Haircut: At Home vs. At the Salon",
    "text": "Getting a haircut can be a very different experience depending on where you go. At home, a family member might cut your hair. It is usually quick and comfortable because you are in a familiar place. You can talk or watch TV while someone carefully trims your hair. On the other hand, getting a haircut at the salon is more like a special event. Salons have big mirrors, fancy chairs, and lots of hair products. A professional stylist cuts your hair, and they can give many suggestions about styles. While the salon can be exciting and fun, it might feel a little nervous because it is a new place with new people. Both at home and at the salon, the goal is to make your hair look nice. Choosing between the two depends on what makes you feel happiest and most relaxed during your haircut."
  },
  {
    "grade": 4,
    "passage_code": "G4-093",
    "title": "Listening to Coach Taylor",
    "text": "It was the first day of soccer practice for Mia's team. Everyone was excited but a little nervous. Coach Taylor blew the whistle and called the players to gather around. \"Today, we will learn how to pass the ball correctly,\" he said. Mia listened carefully as Coach Taylor explained the steps. \"Keep your eyes on the ball, use the inside of your foot, and follow through in the direction you want the ball to go.\" At first, Mia struggled, but she didn't give up. She remembered the coach's advice and kept practicing. After a few tries, her passes became stronger and more accurate. Coach Taylor smiled and said, \"Great job, Mia! Listening to instructions helps you improve.\" Mia felt proud. She knew that paying attention to the coach would help her become a better player this season."
  },
  {
    "grade": 4,
    "passage_code": "G4-094",
    "title": "A Fun Music Lesson Day",
    "text": "Today was a special day in Mrs. Lee's music class. First, the teacher asked everyone to bring their favorite musical instrument to school. Some students brought recorders, others had drums, and a few brought tambourines. Next, Mrs. Lee showed the class how to play a simple song using clapping and tapping. Everyone practiced together, trying to keep the beat. Then, the students formed small groups and chose an instrument to play. Each group worked hard to learn their part of the song. Finally, at the end of the lesson, the class performed the song for their friends in the hallway. It was a happy moment, and everyone felt proud of what they had learned. Music lesson day was fun and helped the students discover the joy of making music together."
  },
  {
    "grade": 4,
    "passage_code": "G4-095",
    "title": "How Mammal Babies Grow",
    "text": "Mammals are special animals because they give birth to live babies instead of laying eggs. When a baby mammal is born, it needs milk from its mother to grow strong. This milk is full of nutrients that help the baby develop. Because the mother feeds her baby with milk, the baby can grow quickly and become healthy. Another reason mammal babies grow well is that they spend time close to their mothers. The mother keeps them warm and safe. When baby mammals stay near their mothers, they learn important skills like finding food or staying away from danger. So, the cause of baby mammals growing strong is the care and milk they get from their mothers. Without this care, the babies would not survive as easily. This shows how important a mother's love is in the animal world."
  },
  {
    "grade": 4,
    "passage_code": "G4-096",
    "title": "Spiders vs. Insects: What's the Difference?",
    "text": "Spiders and insects are both small creatures that live all around us, but they are very different. Spiders belong to a group called arachnids, while insects belong to a different group called insects. One big difference is their body parts. Spiders have two main parts: the cephalothorax and the abdomen. Insects have three parts: the head, thorax, and abdomen. Also, spiders have eight legs, but insects only have six legs. Another difference is that most insects have wings, but spiders do not. Spiders use their silk to make webs, which help them catch food. Insects can be found on plants, flying in the air, or crawling on the ground. Even though they look different, both spiders and insects play important roles in nature by helping control pests and pollinate plants."
  },
  {
    "grade": 4,
    "passage_code": "G4-097",
    "title": "Taking Turns Is Important",
    "text": "Taking turns is a helpful way to make sure everyone gets a chance to do something. When you take turns, you wait patiently for your turn to play a game, talk in class, or use a toy. This helps people feel happy and fair. For example, when children play on the swings, they wait for their turn instead of pushing or grabbing. Taking turns also teaches us to be patient and kind to others. It is a way to show respect and to share. When people take turns, it can help solve problems and avoid arguments. Remember, everyone likes to have their turn, so waiting nicely is a good skill to have. Next time you play or work with friends, try taking turns. It will make the time more fun for everyone!"
  },
  {
    "grade": 4,
    "passage_code": "G4-098",
    "title": "Swimming Lesson: Safety Rules",
    "text": "Swimming is a fun and healthy sport, but it is very important to follow safety rules. In a swimming lesson, students learn how to stay safe in the water. One rule is to always swim with a buddy. This means you never swim alone, which is different from swimming by yourself at home. Another rule is to listen carefully to the instructor. The instructor knows the right way to swim and how to avoid danger. Some kids may find swimming lessons exciting and want to jump in quickly, while others may feel nervous and take their time. Both feelings are okay, but following safety rules helps everyone stay safe. Comparing different swimming styles, such as freestyle and breaststroke, shows how each stroke has its own rules and techniques. However, the main safety rules, like not running near the pool and using life jackets if needed, remain the same. By following these rules, swimming lessons can be safe and enjoyable for all students."
  },
  {
    "grade": 4,
    "passage_code": "G4-099",
    "title": "Timmy the Turtle's Big Race",
    "text": "Timmy was a small turtle who loved races more than anything else. Every day, he practiced running slowly but carefully. His friends laughed because turtles are usually slow, but Timmy believed in the saying, \"Slow and steady wins the race.\" One sunny morning, the forest animals organized a big race. All the animals lined up at the starting line, ready to run as fast as they could. When the race began, the rabbits and squirrels dashed ahead quickly, while Timmy moved along at his usual slow pace. Along the way, the fast animals grew tired or stopped to rest. Timmy, however, kept moving steadily without stopping. Near the finish line, Timmy saw the other racers resting under a tree. He smiled and kept going. Slowly but surely, Timmy crossed the finish line first. Everyone cheered and learned that being patient and steady can help you win in the end."
  },
  {
    "grade": 4,
    "passage_code": "G4-100",
    "title": "Building Tall Towers: Blocks vs. Cards",
    "text": "Building tall towers is a fun way to play, but you can use different materials to do it. Some children like to build towers using wooden blocks. Blocks are strong and stack easily, which helps make a tower stable and tall. When you use blocks, you can see and feel each piece, making it easier to balance the tower. On the other hand, some kids prefer using playing cards to build their towers. Card towers require a gentle touch because cards are light and can fall quickly. Unlike blocks, cards need to be leaned against each other carefully to stay standing. While block towers can be knocked down by pushing just one block, card towers might tumble even if you breathe too hard! Both ways of building towers are exciting but need different skills: blocks teach stability, and cards teach patience and careful movements. Whether you choose blocks or cards, building tall towers is a great way to play and learn."
  }
]