[
  {
    "grade": 3,
    "passage_code": "G3-001",
    "title": "Meeting a New Friend",
    "text": "Anna was playing in the park when she saw a boy her age sitting alone on a bench. She walked over and said, \"Hi, I'm Anna. What's your name?\" The boy smiled and replied, \"I'm Ben. I just moved here.\" Anna asked, \"Do you want to play with me?\" Ben nodded happily. They started playing tag and laughed a lot. After a while, Anna said, \"I'm glad we met today.\" Ben agreed, \"Me too! I hope we can be friends.\" They both felt happy to have found a new friend."
  },
  {
    "grade": 3,
    "passage_code": "G3-002",
    "title": "The Cloud That Makes Shapes",
    "text": "\"Look up, Mia!\" said Jack. \"Do you see that cloud? It looks like a dragon!\" Mia laughed. \"I see a bunny, not a dragon!\" Suddenly, the cloud changed. \"Now it looks like a castle,\" said Jack. \"Wow!\" said Mia. \"This cloud is magic. It makes shapes just for us!\" \"What shape will it make next?\" asked Jack. The cloud slowly turned into a big smiling face. \"Hello, friends!\" the cloud seemed to say. Mia smiled. \"I love watching the sky with you, Jack.\" \"Me too,\" Jack replied. \"Every cloud tells a fun story!\""
  },
  {
    "grade": 3,
    "passage_code": "G3-003",
    "title": "Clearing the Table",
    "text": "After eating a meal, it is important to clear the table. First, start by picking up all the plates. Carry them carefully to the sink or dishwasher. Next, gather any cups and glasses and place them in the sink. Then, collect the used utensils like forks, knives, and spoons. Make sure to stack them neatly. After that, take any leftover food and put it in the trash or a container for saving. Finally, use a cloth or sponge to wipe the table clean. Clearing the table helps keep the kitchen tidy and ready for the next meal."
  },
  {
    "grade": 3,
    "passage_code": "G3-004",
    "title": "Crispin the Carrot's Skateboard Adventure",
    "text": "Crispin was no ordinary carrot. He dreamed of skateboarding! Every day, he watched kids zoom by on their boards and wished he could try. One sunny morning, Crispin found a tiny skateboard just his size. He hopped on and wobbled at first. But soon, he was skating down the garden path, doing funny spins and jumps. The other vegetables cheered him on. \"Go, Crispin, go!\" they shouted. Even the grumpy old tomato smiled. Crispin was the happiest carrot in the patch. He proved that even a carrot can have big dreams and skate with style!"
  },
  {
    "grade": 3,
    "passage_code": "G3-005",
    "title": "The Shadow Adventure",
    "text": "One sunny afternoon, Mia and her brother Ben went outside to play. They noticed their shadows on the ground. Mia jumped, and her shadow jumped too! Ben held a toy car close to the sunlight. The car's shadow appeared on the wall. They learned that shadows happen when something blocks the light. As the sun moved, their shadows changed size and shape. Mia's shadow got longer, while Ben's shadow became shorter. They realized that shadows always follow the light and change throughout the day. It was a fun way to learn about light and shadows!"
  },
  {
    "grade": 3,
    "passage_code": "G3-006",
    "title": "Fog and Mist: Nature's Cozy Blanket",
    "text": "Fog and mist are like soft blankets made of tiny water droplets that float in the air. They form when warm, moist air cools down quickly, usually in the early morning or evening. Fog is thicker than mist and makes it harder to see far away. Mist is lighter and looks like a thin cloud near the ground. Both fog and mist happen when the air is full of moisture and the temperature drops. They can make everything look magical and mysterious, covering trees, fields, and lakes in a gentle, white cover."
  },
  {
    "grade": 3,
    "passage_code": "G3-007",
    "title": "Learning to Tie My Shoes",
    "text": "One day, Mia wanted to tie her own shoelaces. Before, her mom always helped her, but now Mia was ready to try. She sat on the floor and looked at the laces carefully. First, she crossed one lace over the other and pulled it tight. Then, she made a loop with one lace and wrapped the other lace around it. At first, it was tricky, and the laces came undone. But Mia didn't give up. She practiced every day after school. Soon, she could tie her shoelaces all by herself! Mia felt proud and happy because she learned something new that helped her every day."
  },
  {
    "grade": 3,
    "passage_code": "G3-008",
    "title": "Dancing to the Beat",
    "text": "Lily was excited about her first dance class. When she walked into the room, she saw colorful ribbons and a big mirror. The teacher smiled and said, \"Today, we will learn about rhythm.\" Lily listened carefully as the teacher clapped her hands. The students tried to clap with her, keeping the beat. Then, they moved their feet to the music, stepping left and right. Lily loved how the rhythm made her feel happy and energetic. By the end of the class, she could dance to the music all by herself. She couldn't wait to come back next week and dance some more!"
  },
  {
    "grade": 3,
    "passage_code": "G3-009",
    "title": "How Mammal Babies Grow",
    "text": "Mammals are special animals because they have babies that grow inside their bodies. First, a mother mammal carries her baby in a safe place called the womb. Next, the baby grows and gets all the food it needs from the mother. When the baby is ready, it is born. After birth, the baby drinks milk from its mother. This milk helps the baby grow strong and healthy. Finally, as the baby gets bigger, it starts to eat solid food and learns to live on its own. This is how mammals take care of their babies step by step."
  },
  {
    "grade": 3,
    "passage_code": "G3-010",
    "title": "Making Thank-You Cards",
    "text": "Lily and her friends loved to play together after school. One sunny afternoon, their teacher asked them to make thank-you cards for the playground helpers. Lily was excited because she liked crafts. She picked bright paper and colorful markers. Her friend Sam glued shiny stickers on his card. They wrote kind messages to say thank you. When they finished, the teacher smiled and said, \"These cards will make the helpers very happy!\" Lily felt proud. Playing and making cards was fun, and she learned how a little kindness can go a long way."
  },
  {
    "grade": 3,
    "passage_code": "G3-011",
    "title": "A Humble Winner",
    "text": "\"Wow, you played really well today!\" said Mia to her friend, Leo, after their soccer game. Leo smiled and replied, \"Thanks, Mia! You were great too.\" Mia asked, \"How do you feel about winning the game?\" Leo thought for a moment and said, \"I'm happy, but I also know that winning isn't everything. It's important to be kind and thank everyone who played.\" Mia nodded and said, \"I agree! Being a good sport makes the game more fun for everyone.\" Leo smiled and added, \"Next time, we both can try our best and enjoy the game, no matter who wins!\""
  },
  {
    "grade": 3,
    "passage_code": "G3-012",
    "title": "Playing Pretend Restaurant",
    "text": "Playing pretend restaurant is a favorite game for many children. Some kids like to be the chef and cook imaginary meals, while others enjoy being the customer and ordering food. Both roles are fun but different. The chef mixes ingredients and decides what to serve. The customer chooses what to eat and practices polite manners. In both roles, players use their imagination and talk to each other, which helps them learn communication skills. Whether you play as the chef or the customer, pretend restaurant games are a great way to have fun and learn at the same time."
  },
  {
    "grade": 3,
    "passage_code": "G3-013",
    "title": "The Silly Riddle Game",
    "text": "Lily and Max were playing in the park. Lily said, \"I have a silly riddle for you!\" Max smiled and replied, \"Okay, tell me!\" Lily asked, \"What has four legs in the morning, two legs at noon, and three legs in the evening?\" Max thought hard and said, \"Hmm, is it a table?\" Lily laughed, \"No! It's a person! As a baby, they crawl on all fours, as an adult they walk on two legs, and when old, they use a cane.\" Max clapped his hands, \"That's funny and tricky! Your turn to guess now!\""
  },
  {
    "grade": 3,
    "passage_code": "G3-014",
    "title": "Fun with Simple Sewing",
    "text": "Playing by sewing felt shapes is safe and fun. When children use felt, they feel soft and smooth fabric. Because felt does not fray, kids can easily sew without worrying about edges. When they sew buttons or beads onto the felt, their hands become stronger and more skilled. If the stitches are tight, the felt pieces stay together well. This cause-and-effect helps kids learn to be patient and careful. In the end, they create colorful decorations or small toys. Playing with felt sewing makes children proud and happy because they made something special by themselves."
  },
  {
    "grade": 3,
    "passage_code": "G3-015",
    "title": "Going to the Pool on a Hot Day",
    "text": "Today is very hot, so Mia and her family decide to go to the pool. When the sun shines brightly, people feel warm and want to cool off. Because the pool has cold water, Mia feels happy and refreshed when she jumps in. The water helps her body cool down, so she can play longer without feeling tired. After swimming, Mia drinks water to stay hydrated. When people stay hydrated, they feel better and can enjoy their activities more. Going to the pool on a hot day helps Mia and her family have fun and stay comfortable."
  },
  {
    "grade": 3,
    "passage_code": "G3-016",
    "title": "Pool Safety Rules",
    "text": "Swimming is fun, but it is important to stay safe. Always swim with a buddy, never alone. Make sure an adult is watching when you are in the pool. Never run around the pool because you might slip and fall. Always use the stairs or ladder to get in and out of the pool safely. If you do not know how to swim well, use a life jacket or floaties. Remember to listen to the lifeguard and follow the pool rules. Being careful helps everyone have fun and stay safe in the water!"
  },
  {
    "grade": 3,
    "passage_code": "G3-017",
    "title": "Drumming on a Table: Soft Beats and Loud Hits",
    "text": "Drumming on a table can be fun! Some children tap their fingers gently, making soft sounds. Others hit the table harder, creating loud beats. Soft drumming sounds like a quiet rain, while loud drumming feels like thunder. Gentle drumming is smooth and calm, perfect for sharing with friends. Loud drumming is strong and exciting, but it can be noisy for others nearby. Both ways of drumming are enjoyable, but it is important to be kind and listen to what others like. Playing softly on a table can make everyone smile without causing any trouble."
  },
  {
    "grade": 3,
    "passage_code": "G3-018",
    "title": "Tic-Tac-Toe Strategy",
    "text": "Tic-tac-toe is a fun game to play with friends. The game is played on a grid with nine squares. Two players take turns placing Xs and Os in the squares. The goal is to get three in a row-across, down, or diagonal. One good strategy is to start in a corner. This gives more chances to win. Another tip is to watch your opponent's moves. Try to block them if they are close to three in a row. If you follow these ideas, you can have more fun and win more games!"
  },
  {
    "grade": 3,
    "passage_code": "G3-019",
    "title": "Asking for Help Makes Life Easier",
    "text": "Sometimes, life can be hard. When we try to do everything alone, we might feel tired or confused. Because we ask for help, we can learn new things faster and finish tasks more easily. For example, if a child does not understand a math problem, they ask a teacher or a friend. This helps them find the answer quickly. Also, asking for help can make us feel happy because we know others care about us. So, when life is difficult, asking for help is a good choice. It makes life easier and better for everyone."
  },
  {
    "grade": 3,
    "passage_code": "G3-020",
    "title": "Exploring Directions: North, South, East, and West",
    "text": "North, South, East, and West are the four main directions on a compass. North points to the top of a map, while South points to the bottom. East is the direction where the sun rises, on the right side of a map, and West is where the sun sets, on the left side. These directions help people find places and understand where they are. For example, if you are facing North, East will be on your right, and West will be on your left. Knowing these directions is important for exploring and learning about the world around us."
  },
  {
    "grade": 3,
    "passage_code": "G3-021",
    "title": "Playing Fairly at Recess",
    "text": "During recess, Mia and Liam wanted to play tag. Liam said, \"Let's make sure we play fairly! No pushing or cheating.\" Mia nodded, \"Good idea! We should take turns being 'it.'\" As they played, Mia tagged Liam gently. Liam smiled, \"Thanks for playing nicely.\" Another friend, Sam, joined and asked, \"Can I play too?\" Mia replied, \"Yes! Let's all follow the rules and have fun together.\" They all agreed to be kind and fair while playing. At the end, they laughed and said, \"Playing fair makes recess the best!\""
  },
  {
    "grade": 3,
    "passage_code": "G3-022",
    "title": "How to Make a Simple Sandwich",
    "text": "Making a simple sandwich is easy and fun! First, wash your hands to keep everything clean. Next, take two slices of bread and lay them on a plate. Then, spread some butter or peanut butter on one slice. You can use a spoon or a butter knife. After that, add your favorite toppings like jelly, cheese, or ham. Finally, put the other slice of bread on top. Press it gently, and your sandwich is ready to eat! Remember to clean up your area when you finish. Enjoy your tasty sandwich!"
  },
  {
    "grade": 3,
    "passage_code": "G3-023",
    "title": "Measuring with a Ruler",
    "text": "A ruler is a tool used to measure length. It usually has numbers and marks that show inches or centimeters. When you want to know how long something is, you place the ruler next to the object. Start at the zero mark on the ruler, then look at the other end of the object to see the number. This number tells you the length. For example, if a pencil lines up with the 7-inch mark, the pencil is 7 inches long. Measuring helps us in many ways, like knowing if a piece of paper fits in a folder or how tall a plant is growing."
  },
  {
    "grade": 3,
    "passage_code": "G3-024",
    "title": "The Amazing Roots",
    "text": "Lila loved planting flowers in her garden. One day, she asked her teacher why plants have roots. Her teacher smiled and said, \"Roots are like the plant's feet. They grow underground and hold the plant in place so it doesn't fall over.\" Lila was surprised to learn that roots also drink water and take in food from the soil. She imagined the roots as tiny straws that help the plant grow big and strong. Now, every time she watered her flowers, she thought about how the roots were working hard beneath the ground."
  },
  {
    "grade": 3,
    "passage_code": "G3-025",
    "title": "Making a Pretend Map",
    "text": "One sunny afternoon, Mia and her brother Leo decided to play pirates. They wanted to find hidden treasure in their backyard. Mia grabbed a big sheet of paper and some crayons. \"Let's make a map!\" she said. Together, they drew trees, a small pond, and a sandy spot where they could pretend the treasure was buried. Leo added a big X to show where the treasure was hidden. They even made a legend to explain the symbols. With their pretend map in hand, they followed the clues and had so much fun pretending to be pirates searching for treasure."
  },
  {
    "grade": 3,
    "passage_code": "G3-026",
    "title": "Bowling a Straight Roll",
    "text": "Tom: \"How do you bowl a straight roll?\" Anna: \"You need to focus on your target and keep your arm steady.\" Tom: \"I always throw the ball too hard, and it goes off to the side.\" Anna: \"Try to roll it gently and aim for the middle of the lane.\" Tom: \"Okay, I'll try that. What about my fingers?\" Anna: \"Hold the ball with your fingers inside the holes and keep your wrist straight when you release.\" Tom: \"Thanks, Anna! I hope I can bowl better now.\" Anna: \"You will! Just practice and have fun!\""
  },
  {
    "grade": 3,
    "passage_code": "G3-027",
    "title": "Scooter Riding Safety",
    "text": "Tom: Hi Mia! Are you ready to ride your scooter? Mia: Yes, Tom! But first, I put on my helmet and knee pads. Tom: That's smart! Safety gear helps protect you if you fall. Mia: Exactly. Do you know the rules for riding safely? Tom: Sure! We should always ride on the sidewalk, watch for people, and stop at driveways. Mia: And never ride too fast or near cars. Tom: Right! Let's remember these rules so we can have fun and stay safe. Mia: I'm ready! Let's go scooter riding!"
  },
  {
    "grade": 3,
    "passage_code": "G3-028",
    "title": "Cleaning Up Toys",
    "text": "Cleaning up toys is an important task that helps keep your room neat and safe. First, pick up all the toys from the floor. Next, sort them into groups like blocks, dolls, and cars. Then, put each group into its proper box or shelf. After that, check for any broken toys and ask an adult to help fix or throw them away. Finally, make sure the play area looks tidy and everything has a place. By cleaning up toys every day, you help keep your space clean and ready for fun."
  },
  {
    "grade": 3,
    "passage_code": "G3-029",
    "title": "Visiting the Doctor: What Makes Checkups Different",
    "text": "Going to the doctor for a checkup can feel different for everyone. Some kids think it is fun because they get to see new tools and meet the doctor. Others might feel a little nervous at first because they don't know what will happen. However, all checkups have things in common. Doctors listen to your heart, check your eyes, and make sure you are growing healthy. Unlike a visit when you are sick, a checkup is quick and helps keep you well. So, even if it feels strange, a doctor checkup is a good way to learn about your body and stay strong."
  },
  {
    "grade": 3,
    "passage_code": "G3-030",
    "title": "Why Are Bubbles Round?",
    "text": "Tom: Why are bubbles always round? Sara: I wondered that too! My teacher said bubbles are round because of something called surface tension. Tom: Surface tension? What's that? Sara: It's like a skin on the bubble's surface that pulls the soap and water tight. Tom: So, the bubble tries to be the smallest shape? Sara: Exactly! A round shape uses the least surface area, so the bubble stays round to save energy. Tom: Wow, science makes bubbles even cooler! Sara: Yes! Next time you blow bubbles, remember they're round because of science."
  },
  {
    "grade": 3,
    "passage_code": "G3-031",
    "title": "Meeting Max at the Park",
    "text": "One sunny afternoon, Lily went to the park with her mom. While she was playing on the swings, she noticed a boy sitting alone on a bench. His name was Max. Lily smiled and said, \"Hi, do you want to play with me?\" Max nodded happily. They played tag, climbed the jungle gym, and shared their snacks. Lily learned that Max had just moved to town and didn't know anyone yet. By the end of the day, they had become good friends. Lily felt happy because meeting Max made her day special."
  },
  {
    "grade": 3,
    "passage_code": "G3-032",
    "title": "Choosing the Perfect Bedtime Story",
    "text": "Every night, Mia likes to read a bedtime story before she goes to sleep. One evening, she felt very tired and needed a calm story. She chose a gentle tale about a little bunny who found a cozy home. Because the story was soft and peaceful, Mia felt relaxed and fell asleep quickly. Another night, Mia picked a story about a brave knight and a dragon. This exciting story made her feel wide awake because it was full of action. Mia learned that choosing a calm story helps her sleep better, while exciting stories can keep her awake longer."
  },
  {
    "grade": 3,
    "passage_code": "G3-033",
    "title": "The Mystery of the Missing Bookmark",
    "text": "Lily loved reading her favorite book every night. One evening, she couldn't find her special bookmark. She looked everywhere but it was gone! Because the bookmark was missing, Lily couldn't save her place in the story. She felt upset and worried she might lose her spot. Then, she remembered her little brother had been playing near her books earlier. Lily asked him if he saw the bookmark. He smiled and handed it to her-it was under his toy car! Because her brother had moved the bookmark, it got lost. Lily was happy to find it and could finish reading her book."
  },
  {
    "grade": 3,
    "passage_code": "G3-034",
    "title": "Matching Card Games: Old vs. New",
    "text": "Matching card games are fun to play and help improve memory. Some matching games use simple pictures, like animals or shapes, while others use numbers or words. Old matching games often have colorful drawings on cards, and players flip them over to find pairs. Newer games might have electronic cards or apps that show matching images on a screen. Both types of games help players practice focus and attention. While old card games can be played anywhere without batteries, new digital games may have sounds and animations that make playing more exciting. Whether old or new, matching card games are great for learning and play!"
  },
  {
    "grade": 3,
    "passage_code": "G3-035",
    "title": "How to Roll a Bowling Ball Straight",
    "text": "Bowling is a fun sport where you roll a ball to knock down pins. To roll the ball straight, follow these steps. First, hold the ball with your fingers in the holes and your palm under it. Next, stand with one foot slightly in front of the other. Then, take a few steps forward while swinging the ball back and forth. When you reach the line, gently release the ball and aim for the middle of the lane. Finally, watch the ball roll straight to hit the pins. Practice these steps to become a better bowler and have lots of fun!"
  },
  {
    "grade": 3,
    "passage_code": "G3-036",
    "title": "Sammy the Snail's Big Race",
    "text": "Sammy the Snail loved to race, even though he was slow. One sunny day, the animals held a race in the meadow. Sammy joined the race, feeling excited. The rabbits and squirrels ran fast, but Sammy kept moving steadily. Along the way, he helped a lost ant find her home. When Sammy crossed the finish line, all the animals cheered. Sammy didn't win first place, but he got a shiny blue ribbon for being kind and never giving up. Sammy was proud and happy. He learned that trying your best is what matters most!"
  },
  {
    "grade": 3,
    "passage_code": "G3-037",
    "title": "How Metamorphic Rocks Are Made",
    "text": "Metamorphic rocks are special types of rocks that form when other rocks change. This change happens because of heat and pressure deep inside the Earth. When heat warms the rock and pressure pushes on it, the rock changes its shape and type. For example, shale can turn into slate, and limestone can become marble. The heat and pressure cause the minerals inside the rock to rearrange. Because of this, the rock becomes stronger and often looks different than before. So, the cause (heat and pressure) makes the effect (the rock changes into a new kind called metamorphic rock)."
  },
  {
    "grade": 3,
    "passage_code": "G3-038",
    "title": "Sorting Buttons by Color",
    "text": "Emma loved to play with buttons. One rainy afternoon, she found a big box filled with buttons of all colors. She decided to sort them by color. First, she made a pile of red buttons. Next, she found all the blue ones and placed them in another pile. Then, she sorted the green buttons and put them in a small bowl. Emma smiled as she saw the colorful piles. Sorting buttons was fun because it helped her see how many colors there were and made her feel proud of her work."
  },
  {
    "grade": 3,
    "passage_code": "G3-039",
    "title": "Worms and Soil: How They Are Different and Alike",
    "text": "Worms and soil are both very important to gardens and farms. Worms are small animals that live in soil. Soil is the dirt where plants grow. Worms help soil by making it soft. They dig tunnels that let air and water reach plant roots. Soil helps plants by holding water and nutrients. Worms and soil work together, but they are different. Worms are alive and can move. Soil is not alive; it is made of tiny pieces of rock, dead plants, and animals. Both worms and soil help plants stay healthy and grow strong."
  },
  {
    "grade": 3,
    "passage_code": "G3-040",
    "title": "Saving Money in a Jar",
    "text": "When Sarah found an empty jar, she decided to save her coins in it. Every time she got some money, she dropped a few coins into the jar. Because she saved regularly, the jar slowly filled up. As the jar got heavier, Sarah felt happy. She knew that saving money would help her buy a new book she wanted. Since she saved often, she had enough money in the jar by the end of the month. Saving money in a jar helped Sarah learn how to wait and be patient. This showed her that saving little by little can lead to something big."
  },
  {
    "grade": 3,
    "passage_code": "G3-041",
    "title": "Listening to the Coach",
    "text": "In sports, listening to the coach is very important. The coach teaches players new skills and helps the team work together. When players listen carefully, they learn how to play better and stay safe. Coaches also give advice on how to practice and improve. If players do not listen, they might miss important instructions and make mistakes. Listening helps everyone have fun and do their best. So, whether you play soccer, basketball, or any other sport, always pay attention to your coach. This will help you become a great player and a good teammate."
  },
  {
    "grade": 3,
    "passage_code": "G3-042",
    "title": "The Joking Playground Slide",
    "text": "At Sunny Park, there is a special playground slide named Slicky. Slicky is not like other slides because it loves to tell jokes! Every time a child climbs up, Slicky whispers a funny joke. When the child slides down, they giggle and laugh all the way to the bottom. One day, Mia asked, \"Slicky, why did the slide get a ticket?\" Slicky chuckled, \"Because it was speeding!\" The kids loved Slicky's jokes so much that they visited the playground every day to hear new funny stories from their favorite talking slide."
  },
  {
    "grade": 3,
    "passage_code": "G3-043",
    "title": "Aiming at a Target with a Soft Beanbag",
    "text": "Aiming at a target with a soft beanbag is fun and easy! First, stand a few steps away from the target. Hold the beanbag in your hand and get ready to throw. Next, look carefully at the target and decide where you want the beanbag to land. Then, swing your arm back and throw the beanbag gently but straight toward the target. Try to keep your eyes on the spot you want to hit. Finally, watch where the beanbag lands and try again if you miss. With practice, you can get better at aiming and hitting the target every time!"
  },
  {
    "grade": 3,
    "passage_code": "G3-044",
    "title": "Borrowing and Returning Books",
    "text": "Emma: Hi, Jake! Can I borrow your math book for the weekend? Jake: Sure, Emma! I need it on Monday, so please return it by then. Emma: I will. Thanks! I promise to take good care of it. Jake: Great! Also, if you like, you can borrow my colored pencils for your art project. Emma: That's very kind of you. I will bring them back on Monday too. Jake: Thanks for being responsible. It's important to return things on time. Emma: Yes! Borrowing and returning helps us share and stay friends."
  },
  {
    "grade": 3,
    "passage_code": "G3-045",
    "title": "The Life Cycle of a Frog: Then and Now",
    "text": "Frogs go through four main stages in their life cycle: egg, tadpole, froglet, and adult frog. When frogs lay eggs, they float in water. Tadpoles hatch from eggs and live only in water. They have tails and breathe with gills like fish. As tadpoles grow, they become froglets, growing legs and lungs for breathing air. Adult frogs live on land and in water, hopping and catching insects. Tadpoles and adult frogs look very different, but both are important parts of the frog's life. The change from tadpole to frog is called metamorphosis, which shows how animals can change as they grow."
  },
  {
    "grade": 3,
    "passage_code": "G3-046",
    "title": "Making a Friendship Bracelet",
    "text": "A friendship bracelet is a colorful band made by weaving threads together. Many kids enjoy making them because they are fun and easy to create. First, you need some embroidery floss in different colors. Cut several strands of about 12 inches long and tie a knot at one end. Next, you braid or knot the threads in patterns. When finished, tie the bracelet around your wrist or give it to a friend. Friendship bracelets show that you care and help you make new friends. Plus, they are a great way to use your creativity and practice patience!"
  },
  {
    "grade": 3,
    "passage_code": "G3-047",
    "title": "Benny the Bubble-Blowing Fish",
    "text": "Benny was a small fish who lived in a big blue pond. He noticed that all the other fish blew bubbles when they were happy. Benny wanted to blow bubbles too. At first, he tried but only made little splashes. He watched the other fish closely and learned to take a deep breath. Because he practiced every day, Benny finally learned to blow big, shiny bubbles. Now, whenever Benny is happy, he blows bubbles that sparkle in the water. All the fish cheer for Benny because his bubbles make the pond a fun place."
  },
  {
    "grade": 3,
    "passage_code": "G3-048",
    "title": "The Magic Pencil That Draws Real Stickers",
    "text": "One sunny morning, Mia found a shiny pencil on her desk. It was no ordinary pencil-it could draw real stickers! Step 1: Mia held the pencil tightly. Step 2: She drew a bright red apple on a piece of paper. Step 3: To her surprise, the apple popped right off the paper and became a real, sticky sticker. Step 4: Mia stuck the apple sticker on her notebook. Step 5: She drew a blue star next, and it also became a sticker! Now, Mia can create fun stickers anytime she wants with her magic pencil."
  },
  {
    "grade": 3,
    "passage_code": "G3-049",
    "title": "The Magic Umbrella That Made Shade",
    "text": "One sunny day, Mia found a colorful umbrella in her backyard. When she opened it, something surprising happened-the umbrella made a cool shade even when the sun was very bright! Because the shade was so refreshing, Mia invited her friends to play under it. They stayed happy and cool and didn't get tired from the heat. The magic umbrella helped them enjoy their day outside. Since the umbrella made shade everywhere, Mia and her friends could play longer and have more fun. The magic umbrella turned hot days into happy days!"
  },
  {
    "grade": 3,
    "passage_code": "G3-050",
    "title": "Recycling and Sorting: How They Are Different and Similar",
    "text": "Recycling and sorting are two important ways to help the Earth. Sorting means separating trash into groups like paper, plastic, and metal. This helps people know what can be recycled. Recycling is when these materials are changed into new things. For example, old paper can become new notebooks. Both sorting and recycling save resources and keep the environment clean. The difference is sorting happens first, and it is about organizing trash. Recycling comes next, and it is about making something new from the old. Both are good habits to protect our planet!"
  },
  {
    "grade": 3,
    "passage_code": "G3-051",
    "title": "Lily Learns Gymnastics Flexibility",
    "text": "Lily loved to watch gymnastics on TV. One day, she decided to try it herself. At the gym, her coach showed her how important flexibility was. \"Flexibility helps you bend and move easily,\" her coach explained. Lily practiced stretching every day. She reached for her toes, touched the floor, and did gentle splits. At first, it was hard, but Lily kept trying. After many weeks, she could do a perfect bridge and a high kick. Lily felt proud and happy. She knew that with practice, she could become even better at gymnastics!"
  },
  {
    "grade": 3,
    "passage_code": "G3-052",
    "title": "How Metamorphic Rocks Are Made",
    "text": "Metamorphic rocks are special rocks that change from other rocks. First, a rock like limestone or shale is buried deep under Earth. Then, heat from the Earth and pressure from the layers above squeeze the rock very hard. These forces change the rock's shape and make new minerals inside it. The rock becomes harder and looks different. This process takes a very long time, often millions of years. Some common metamorphic rocks are marble and slate. These rocks are used in buildings and art because they are strong and beautiful."
  },
  {
    "grade": 3,
    "passage_code": "G3-053",
    "title": "Learning to Breathe in Swimming",
    "text": "When you swim, it is important to learn how to breathe correctly. If you do not breathe at the right time, you might get tired quickly. For example, when your face is in the water, you need to hold your breath. Then, you turn your head to the side to take a quick breath. If you forget to turn your head, you will swallow water, which can be uncomfortable. Because of this, swimming teachers show students when and how to breathe during lessons. When students practice breathing properly, they can swim longer and feel more comfortable in the water."
  },
  {
    "grade": 3,
    "passage_code": "G3-054",
    "title": "The Big Game Cheer",
    "text": "Coach: \"Alright team, are you ready to cheer our friends to victory?\" Sam: \"Yes, Coach! But what should we say?\" Lily: \"How about, 'Go, team, go! Fight with all your might!'\" Coach: \"That's great, Lily! Let's try it together.\" All: \"Go, team, go! Fight with all your might!\" Sam: \"I think we should add clapping too!\" Coach: \"Good idea, Sam. Everyone, clap twice and shout the cheer again. Ready?\" All: *clap clap* \"Go, team, go! Fight with all your might!\" Lily: \"This will help our friends feel strong and happy!\" Coach: \"Exactly! A good team cheer brings the whole team together.\""
  },
  {
    "grade": 3,
    "passage_code": "G3-055",
    "title": "The Swing That Wanted to Fly",
    "text": "In a small playground, there was a swing named Swifty. Swifty loved to swing back and forth, but it dreamed of flying high in the sky like a bird. Every day, Swifty wished it could soar above the trees and clouds. One windy afternoon, a little girl named Mia pushed Swifty very fast. Swifty felt the wind rush past and imagined it was flying. Although swings can't truly fly, Swifty learned that swinging high made its dream come true in a special way. Swifty was happy to bring joy and fun to children who visited the park."
  },
  {
    "grade": 3,
    "passage_code": "G3-056",
    "title": "The Brave Little Spoon",
    "text": "\"I wish I was as big as a fork,\" said the little spoon sadly. \"Why?\" asked the fork. \"You're special just the way you are!\" \"But everyone uses forks for big meals,\" the spoon said. \"I only get used for soup or dessert.\" Just then, a tiny kitten knocked over a bowl of hot soup. \"Oh no!\" cried the family. The little spoon jumped forward. \"I can help!\" it said bravely. With care, the spoon scooped up the soup, saving the floor from a mess. \"Wow!\" said the fork. \"You're really brave and important.\" The spoon smiled. \"I'm happy to help. Being little can be mighty!\""
  },
  {
    "grade": 3,
    "passage_code": "G3-057",
    "title": "Learning to Skate for Hockey",
    "text": "Emma was very excited to learn how to play hockey. Her coach told her that the first thing she needed to learn was how to skate well. On her first day, Emma put on her skates and stepped onto the ice. At first, she felt wobbly and scared she might fall. Her coach showed her how to bend her knees and push off with her feet. Emma practiced sliding forward and stopping safely. After some tries, she began to glide smoothly across the ice. Emma smiled, happy to know that with practice, she could skate like a hockey player!"
  },
  {
    "grade": 3,
    "passage_code": "G3-058",
    "title": "Why Does a Cold Glass Get Wet?",
    "text": "Have you ever noticed that a cold glass gets wet on the outside? This happens because of condensation. When you put cold water in a glass, the glass becomes cold too. The air around the glass has tiny drops of water called water vapor. When the warm air touches the cold glass, the water vapor cools down and turns into liquid drops on the glass. This is different from rain, where water falls from the sky. Condensation happens only when warm air meets a cold surface, like your glass. So, a cold glass and warm air work together to make the glass wet!"
  },
  {
    "grade": 3,
    "passage_code": "G3-059",
    "title": "Sally the Snail's Big Win",
    "text": "\"I can't believe it, Sally! You won the race!\" cheered Timmy the turtle. Sally the snail smiled slowly. \"Thank you, Timmy! I never thought I could win a ribbon.\" \"You were so steady and never gave up,\" said Bella the butterfly. \"I kept going, one slow step at a time,\" Sally explained. \"It's not about being fast; it's about trying your best.\" \"You're right!\" Timmy nodded. \"You showed us all that courage is what counts.\" Sally held her ribbon proudly. \"This means a lot to me. Let's all keep trying, no matter how slow or fast we are!\""
  },
  {
    "grade": 3,
    "passage_code": "G3-060",
    "title": "Playing Jigsaw Puzzles Together",
    "text": "Playing jigsaw puzzles can be fun alone or with friends. When you play alone, you work quietly and take your time finding each piece. You can focus on the puzzle your way. But when you play with friends, teamwork is key. Friends can help find pieces faster and share ideas about where pieces fit. Sometimes, playing alone means you can relax and think deeply. Playing with others brings excitement, as you talk and laugh while working together. Both ways are great, but working as a team helps finish the puzzle quicker and makes the game more fun."
  },
  {
    "grade": 3,
    "passage_code": "G3-061",
    "title": "Learning Ringette with Mia and Ben",
    "text": "Mia: \"Have you ever played ringette, Ben?\" Ben: \"No, what is it?\" Mia: \"It's a fun ice sport like hockey, but we use a ring instead of a puck.\" Ben: \"Cool! How do you play?\" Mia: \"You skate on the ice and pass the ring to your teammates with a stick.\" Ben: \"Do you score goals like in hockey?\" Mia: \"Yes! The goal is to get the ring into the other team's net.\" Ben: \"Sounds exciting! Can I try it sometime?\" Mia: \"Of course! It's easy to learn and lots of fun!\""
  },
  {
    "grade": 3,
    "passage_code": "G3-062",
    "title": "How to Pass a Soccer Ball",
    "text": "Passing the soccer ball to your teammates is very important in a game. Here are the steps to pass the ball well. First, look at the teammate you want to pass to. Second, make sure you are close enough to pass the ball. Third, use the inside of your foot to kick the ball gently. Fourth, follow through with your kick by moving your foot in the direction of your teammate. Finally, watch where the ball goes and be ready to run and play. Practicing these steps will help you pass better and enjoy soccer even more!"
  },
  {
    "grade": 3,
    "passage_code": "G3-063",
    "title": "Hattie the Shy Hat Finds a Friend",
    "text": "Step 1: Hattie was a small, shy hat sitting alone on a store shelf. She wished for a friend to play with. Step 2: Every day, Hattie watched children pick other hats. She felt lonely and hoped someone would choose her. Step 3: One sunny morning, a little girl named Mia came into the store. She loved hats but couldn't find the right one. Step 4: Mia saw Hattie and smiled. She gently picked Hattie up and put her on her head. Step 5: Hattie felt happy and brave. She had found a friend at last!"
  },
  {
    "grade": 3,
    "passage_code": "G3-064",
    "title": "How to Catch a Moonbeam in a Jar",
    "text": "One night, Lily wanted to catch a moonbeam. First, she found a shiny jar with a tight lid. Next, she went outside and looked up at the bright moon. She held the jar high, hoping a moonbeam would slip inside. Then, she closed the jar quickly and smiled. Lily took her jar inside and placed it on her windowsill. Every night, the moonbeam glowed softly inside the jar, lighting up her room with a gentle, magical light. Lily felt happy to have a bit of the moon all to herself."
  },
  {
    "grade": 3,
    "passage_code": "G3-065",
    "title": "How Word Search Games Help Us Learn",
    "text": "Playing word search games is both fun and helpful. When you look for words in the puzzle, your brain works hard to find patterns. Because you focus on each letter, you improve your spelling skills. Also, searching for words quickly helps you pay better attention. As a result, you become faster at reading and understanding new words. Many kids play word search games to relax, but they also learn more without even realizing it. So, the next time you play a word search, remember that it is helping your brain grow while you have fun!"
  },
  {
    "grade": 3,
    "passage_code": "G3-066",
    "title": "Wally the Helpful Wizard",
    "text": "Wally is a kind wizard who lives in a bright blue tower. Unlike other wizards, Wally only knows helpful spells. He can't cast scary or tricky magic. Instead, Wally uses his powers to help others. If someone is sad, Wally can make flowers bloom to cheer them up. If a friend loses their way, Wally casts a gentle light to guide them home. Everyone in the village loves Wally because he always uses his magic for good. Wally teaches that being kind and helpful is the best kind of magic."
  },
  {
    "grade": 3,
    "passage_code": "G3-067",
    "title": "Making Shapes with Playdough",
    "text": "Anna and Ben sat at the table with colorful playdough. \"Let's make shapes!\" Anna said. Ben smiled, \"I want to make a star.\" Anna rolled her playdough into a ball. \"I will make a circle,\" she said. Ben pressed his dough flat and cut out a star shape. \"Look, my star has five points!\" he said proudly. Anna clapped her hands. \"My circle is smooth and round.\" They laughed and shared their shapes. \"Playdough is fun because we can make anything,\" Anna said. Ben nodded, \"Yes, and we can use our hands to create shapes and stories!\""
  },
  {
    "grade": 3,
    "passage_code": "G3-068",
    "title": "Building a Blanket Fort",
    "text": "Lily and her brother wanted to have a fun place to play inside. They decided to build a fort using blankets and chairs. Because they used many blankets, the fort became cozy and warm. Since the fort was small and dark, they brought in a flashlight to see inside. Building the fort made them happy because they could play games and read books inside. Because they worked together, the fort was strong and did not fall down. In the end, building the blanket fort gave them a special place to play and enjoy their day."
  },
  {
    "grade": 3,
    "passage_code": "G3-069",
    "title": "Static Electricity and the Balloon Trick",
    "text": "Static electricity is a type of electricity that stays in one place instead of flowing like the electricity in wires. When you rub a balloon on your hair, the balloon gets static electricity. This makes the balloon and your hair different. Your hair loses electrons and becomes positive, while the balloon gains electrons and becomes negative. Because opposite charges attract, your hair sticks to the balloon. If you try the same trick with a plastic comb, it works similarly but is different because the comb can attract small pieces of paper instead of your hair. Both the balloon and the comb show how static electricity can make things stick!"
  },
  {
    "grade": 3,
    "passage_code": "G3-070",
    "title": "The Puppet Show Surprise",
    "text": "Anna and Ben were excited. Today was the day of their first puppet show! Anna held a colorful frog puppet. Ben had a funny cat puppet. \"Ready to start?\" asked Anna. \"Yes! Let's make everyone laugh,\" Ben said. They waved their puppets on the small stage. The frog said, \"Ribbit! I love playing in the pond!\" The cat replied, \"Meow! I prefer chasing yarn!\" Their friends clapped and laughed. After the show, Anna smiled. \"That was fun!\" Ben nodded, \"We should do it again!\" The two friends planned their next puppet adventure."
  },
  {
    "grade": 3,
    "passage_code": "G3-071",
    "title": "Cycling with and without a Helmet",
    "text": "Cycling is a fun sport that many children enjoy. Some kids always wear a helmet when they ride their bikes, while others do not. Wearing a helmet helps protect your head if you fall or crash. Helmets are made of strong materials that absorb the impact and keep your brain safe. Kids without helmets are more likely to get hurt if they have an accident. Although helmets might feel a little warm or heavy, they are very important for safety. In comparison, riding without a helmet feels freer but is riskier. Always wearing a helmet helps cyclists stay safe and enjoy their rides with more confidence."
  },
  {
    "grade": 3,
    "passage_code": "G3-072",
    "title": "The Balloon That Wouldn't Pop",
    "text": "One sunny day, Mia got a bright red balloon at the park. She held it tightly, but it felt special. When she bumped it on a tree branch, the balloon didn't pop! Mia laughed and tried to pop it with a stick, but the balloon stayed safe and round. She showed it to her friends, who were amazed. \"This balloon must be magic!\" said Mia. All day, the balloon floated beside her, never popping, no matter what. Mia felt happy to have such a strong, magical balloon that would never pop."
  },
  {
    "grade": 3,
    "passage_code": "G3-073",
    "title": "A Moonbeam in a Jar",
    "text": "One clear night, Mia found a glowing jar on her windowsill. Inside, a tiny moonbeam danced softly. Mia had caught it with a little net made from silver thread. She wondered what to do with such a magical light. Carefully, she carried the jar to her garden and set it on a stone. The moonbeam twirled happily, lighting up the flowers around it. Mia smiled, knowing she had a special friend to keep her company during the dark nights. She promised to always keep the jar safe so the moonbeam could shine bright forever."
  },
  {
    "grade": 3,
    "passage_code": "G3-074",
    "title": "Helping with Groceries",
    "text": "When you help with groceries, you do important work. First, you can carry light bags from the car to the kitchen. This helps your family save time and energy. Next, you can help put food away. Putting fruits and vegetables in the fridge or pantry keeps them fresh and ready to eat. Helping with groceries also teaches you to be responsible. You learn how to organize items and make sure nothing is left out. It feels good to help your family and be part of the daily chores. Everyone can help, no matter how small the task!"
  },
  {
    "grade": 3,
    "passage_code": "G3-075",
    "title": "The Lunchroom Table with Secrets",
    "text": "In the school lunchroom, there are two tables side by side. One table is quiet and neat. Kids sit nicely and eat their sandwiches. The other table is noisy and silly. Kids laugh loudly and spill their juice. Both tables have something special. The quiet table has secret notes hidden under plates. The silly table has tiny toys stuck under the chairs. The quiet table's secrets are calm and mysterious. The silly table's secrets are fun and surprising. Even though these tables are different, they both hold secrets that make lunchtime exciting!"
  },
  {
    "grade": 3,
    "passage_code": "G3-076",
    "title": "How to Write a Short Poem About Play",
    "text": "Writing a poem about play is fun and easy! Step 1: Think about your favorite way to play. It could be playing tag, drawing, or building with blocks. Step 2: Choose simple words that describe how you feel when you play. Words like happy, fun, fast, or bright are great. Step 3: Write two or three short sentences. Each sentence can be a line in your poem. Step 4: Try to make your poem rhyme if you want. For example, \"I run and jump all day, Playing games is fun, I say!\" Step 5: Read your poem out loud. Share it with a friend or family member. Now you have a poem about play!"
  },
  {
    "grade": 3,
    "passage_code": "G3-077",
    "title": "How Worms Help the Soil",
    "text": "Worms play an important role in keeping soil healthy. When worms dig tunnels underground, they make space for air and water to reach plant roots. This helps plants grow better. Also, worms eat dead leaves and other materials in the soil. When they digest these materials, they create nutrient-rich waste called castings. These castings act like natural fertilizer, making the soil stronger and full of nutrients. Because of worms, soil becomes soft and fertile, which helps plants grow big and strong. Without worms, the soil would be hard and less healthy."
  },
  {
    "grade": 3,
    "passage_code": "G3-078",
    "title": "How to Borrow and Return Items",
    "text": "Sometimes, we need to borrow things like books, toys, or pencils from our friends or family. Here are the steps to do it politely. First, ask nicely if you can borrow the item. Say please and wait for their answer. Second, take care of the item while you have it. Keep it safe and clean. Third, when you are done, return the item as soon as possible. Make sure it is in good condition. Finally, say thank you for letting you borrow it. Following these steps helps keep friendships strong and shows respect."
  },
  {
    "grade": 3,
    "passage_code": "G3-079",
    "title": "Watering the Garden",
    "text": "Every morning, Mia waters the plants in her garden. She loves to see the flowers grow tall and bright. One day, Mia noticed that some leaves were turning yellow. She asked her mom why this was happening. Her mom explained that plants need just the right amount of water-not too much and not too little. Mia decided to check the soil before watering. If the soil was dry, she gave the plants a drink. Soon, the plants looked happy and healthy again. Mia learned that taking care of plants is like taking care of friends-they need attention and love every day."
  },
  {
    "grade": 3,
    "passage_code": "G3-080",
    "title": "The Tiny Sign Fairy",
    "text": "In a quiet forest, there lived a fairy named Lila who made tiny signs. Lila's signs were different from the big signs people see on roads. Her signs were small and hidden on leaves and tree trunks. While big signs help drivers stay safe, Lila's tiny signs helped animals find food and water. Big signs use bright colors and clear words. Lila's signs used shiny stones and small drawings. Both signs gave important messages, but one was for humans, and the other was for forest creatures. Even though they looked different, both kinds of signs kept everyone safe!"
  },
  {
    "grade": 3,
    "passage_code": "G3-081",
    "title": "How Water Causes Erosion",
    "text": "Erosion happens when soil and rocks are worn away. Water is one of the main causes of erosion. First, rainwater falls on the ground. Then, water flows over the soil, carrying tiny pieces with it. This movement slowly wears down hills and rocks. Sometimes, rivers pick up sand and stones from their banks. Finally, the water deposits these materials in new places, like riverbeds or the ocean shore. This process changes the shape of the land over time. Erosion by water is important because it helps create new landforms and keeps the Earth's surface changing."
  },
  {
    "grade": 3,
    "passage_code": "G3-082",
    "title": "Carrying a Small Bag Safely",
    "text": "Carrying a small bag is easy and can keep your things safe. When you carry a bag, use both straps if it is a backpack. This helps spread the weight evenly on your shoulders. If you have a small bag with one strap, wear it across your body. This keeps the bag close and stops it from slipping off. Always keep your bag zipped or closed. This way, nothing will fall out. Carrying a small bag safely helps you keep your things close and protects your back from pain. Remember to pack only what you need to keep the bag light and comfortable."
  },
  {
    "grade": 3,
    "passage_code": "G3-083",
    "title": "Bees and Honey",
    "text": "Bees are amazing insects that make honey. They live in a place called a hive. Worker bees collect nectar from flowers using their long tongues. They bring the nectar back to the hive where it changes into honey. Honey is sweet and tasty, and bees use it as food. A single bee can visit hundreds of flowers in one day! Bees also help plants grow by moving pollen from one flower to another. This process is called pollination. Without bees, many plants and flowers would have a hard time growing. So, bees are very important for nature and people."
  },
  {
    "grade": 3,
    "passage_code": "G3-084",
    "title": "Choosing Between Two Toys",
    "text": "Step 1: Look at both toys carefully. One is a shiny red car, and the other is a soft teddy bear. Step 2: Think about how you like to play. Do you like racing cars or hugging soft toys? Step 3: Imagine playing with each toy. Which one makes you smile more? Step 4: Ask yourself if you already have a lot of one kind of toy. Step 5: Choose the toy that feels best for you. Remember, it's okay to take your time to decide. Enjoy your new friend!"
  },
  {
    "grade": 3,
    "passage_code": "G3-085",
    "title": "Learning Rink Rules Keeps Everyone Safe",
    "text": "When you learn the rules of the skating rink, you know how to stay safe. For example, if you understand where to skate and where to stop, you will not bump into other skaters. Because everyone follows the same rules, accidents happen less often. This makes skating fun for everyone. Also, when you listen to the rink helpers, you learn how to skate better and avoid falling. As a result, more kids enjoy skating and want to come back again. Learning rink rules helps make the rink a happy place where all skaters can have fun and stay safe."
  },
  {
    "grade": 3,
    "passage_code": "G3-086",
    "title": "Liam Learns to Turn on Skates",
    "text": "Liam was excited to go skating at the park. He loved moving fast on his skates, but turning was hard. At first, he would try to turn quickly and almost fall. His coach, Ms. Anna, smiled and said, \"Bend your knees and lean your body slightly to the side you want to turn.\" Liam tried again. This time, he bent his knees and leaned a little. Slowly, he turned around a corner without falling! He felt proud. Every day, he practiced turning and got better and better. Now, Liam enjoys skating smoothly, turning left and right with ease."
  },
  {
    "grade": 3,
    "passage_code": "G3-087",
    "title": "Tom's First Comic",
    "text": "Tom loved to play after school. One day, he decided to draw a comic. He picked his favorite characters: a brave cat and a funny dog. First, Tom drew the cat saving the dog from a big puddle. Then, he added speech bubbles so they could talk. Tom used bright colors to make the comic exciting. When he finished, he showed it to his friends. They laughed and clapped. Tom felt proud because he made a fun story with his drawings. Now, Tom wants to draw more comics every week!"
  },
  {
    "grade": 3,
    "passage_code": "G3-088",
    "title": "Helping with the Dishes",
    "text": "When I help wash the dishes, it makes my mom very happy. She feels less tired because the chores get done faster. Because I wash the plates carefully, they become clean and ready for the next meal. When the dishes are clean, the kitchen looks nice and tidy. This makes everyone want to eat at the table. Helping with small chores like washing dishes shows that I care about my family. It also teaches me to be responsible. When I do this task often, I get better at cleaning and feel proud of my work."
  },
  {
    "grade": 3,
    "passage_code": "G3-089",
    "title": "How Leaves Help Plants",
    "text": "Leaves are an important part of a plant. Here are the steps to understand how leaves help plants. Step 1: Leaves collect sunlight. They act like little solar panels. Step 2: Inside the leaves, a process called photosynthesis happens. This means leaves use sunlight, water, and air to make food for the plant. Step 3: Leaves also help plants breathe by taking in carbon dioxide and releasing oxygen. Step 4: Finally, leaves help keep the plant cool by releasing water into the air. That is why leaves are very important for plants to grow and stay healthy."
  },
  {
    "grade": 3,
    "passage_code": "G3-090",
    "title": "Dress-Up Costumes: Superheroes and Animals",
    "text": "Playing dress-up is a lot of fun! Some children like to wear superhero costumes. These costumes often have bright colors and capes. Superheroes pretend to have special powers like flying or super strength. Other children enjoy dressing up as animals. Animal costumes might look fuzzy and soft, like a lion or a bunny. Unlike superheroes, animals don't have powers, but they can be very cute and funny. Both types of costumes help children use their imagination. Whether you choose a superhero or an animal, dress-up time is a great way to play and pretend!"
  },
  {
    "grade": 3,
    "passage_code": "G3-091",
    "title": "The Brave Mitten's Winter Adventure",
    "text": "Once upon a time, a small mitten lived on a cold winter day. The mitten was brave because it wanted to help keep a little boy's hand warm. When the snow started to fall heavily, the boy put on the mitten. Because the mitten was warm and cozy, the boy could play outside longer. The mitten did not mind getting wet or cold. Instead, it stayed strong to protect the boy's hand. Because the mitten kept the boy's hand warm, he was happy and could enjoy the snowy winter day."
  },
  {
    "grade": 3,
    "passage_code": "G3-092",
    "title": "Fun with Clay Modeling",
    "text": "Clay modeling is a fun activity where you use soft, non-toxic clay to make shapes and figures. This clay is safe for kids to touch and squish. You can create animals, cars, or even your favorite food! Playing with clay helps your hands become strong and improves your creativity. It also teaches you to be patient as you shape your ideas. When you finish, you can let your clay models dry or keep them soft to play again. Remember to clean your hands after playing to keep them neat and clean!"
  },
  {
    "grade": 3,
    "passage_code": "G3-093",
    "title": "Planning a Fun Playdate",
    "text": "Planning a playdate is easy and fun! First, choose a day and time that works for you and your friend. Next, decide what games or activities you want to do together. You can play board games, draw pictures, or go outside to play. Then, ask your parents for permission and help to make a plan. After that, invite your friend by calling or sending a message. On the day of the playdate, make sure your toys and snacks are ready. Finally, enjoy playing, sharing, and having a great time with your friend!"
  },
  {
    "grade": 3,
    "passage_code": "G3-094",
    "title": "The Talking Bubble",
    "text": "One sunny afternoon, Mia blew a big, shiny bubble from her soap. To her surprise, the bubble began to talk! The bubble said it could share stories from the sky. Because the bubble could talk, Mia listened carefully to many exciting tales about birds and clouds. The bubble told Mia to be kind and brave, which made her very happy. When the bubble finally popped, Mia felt grateful because it had taught her to look at the world in a new way. The talking bubble showed Mia that magic can happen when you least expect it."
  },
  {
    "grade": 3,
    "passage_code": "G3-095",
    "title": "Wally the Helpful Wizard",
    "text": "Wally was a kind wizard who lived in a small village. Unlike other wizards, Wally only knew helpful spells. He could make plants grow tall and strong. He could fix broken toys with a wave of his wand. When it rained, he made sure everyone had dry umbrellas. Wally never used magic to scare anyone. Instead, he used his powers to bring smiles and solve problems. Everyone loved Wally because he made the village a happy and safe place to live. Wally showed that magic is best when it helps others."
  },
  {
    "grade": 3,
    "passage_code": "G3-096",
    "title": "How to Play with a Train Set",
    "text": "Playing with a train set is a lot of fun. First, find a flat surface to build your track. You can use straight and curved pieces to make different shapes. Second, connect the tracks carefully so the train can move smoothly. Third, place the train on the tracks and push the button to start it. Watch the train go around the track! Finally, you can add small houses, trees, and people to make your train world exciting. Playing with a train set helps you use your imagination and have a great time."
  },
  {
    "grade": 3,
    "passage_code": "G3-097",
    "title": "Lila the Tiny Fairy and Her Missing Shoes",
    "text": "Lila is a tiny fairy who loves to dance in the forest. She has shiny blue shoes that sparkle in the sunlight. One day, Lila couldn't find her shoes! She looked under leaves and behind flowers but they were gone. Her friend, Max the mouse, also lost his shoes once, but he found them inside a cozy hole. Unlike Max, Lila's shoes were nowhere near her home. Max's shoes were big and brown, while Lila's were small and bright blue. Even though their shoes were different, both friends helped each other search. In the end, Lila found her shoes stuck on a branch, and she and Max danced happily together."
  },
  {
    "grade": 3,
    "passage_code": "G3-098",
    "title": "The Day Sam Learned About Germs",
    "text": "One day, Sam was playing outside and came inside for lunch. His mom told him to wash his hands. Sam asked, \"Why?\" Mom explained that tiny germs are everywhere. They can make us sick if we don't wash them away. Sam looked at his hands and didn't see anything. Mom said, \"Germs are so small, we can't see them, but they are there.\" Sam washed his hands with soap and water. He rubbed for 20 seconds, just like Mom said. After that, he felt proud. He knew washing his hands helped keep germs away and kept him healthy."
  },
  {
    "grade": 3,
    "passage_code": "G3-099",
    "title": "Why Do Puddles Disappear?",
    "text": "After it rains, you might see puddles on the ground. Have you ever noticed how these puddles slowly get smaller and then disappear? This happens because of a process called evaporation. When the sun shines, it warms the water in the puddle. The heat causes the water to change into tiny invisible drops called water vapor. These drops rise into the air and the puddle gets smaller. So, the sun's heat is the cause, and the effect is the puddle disappearing. This is why puddles dry up on sunny days."
  },
  {
    "grade": 3,
    "passage_code": "G3-100",
    "title": "The Balance on One Foot Challenge",
    "text": "Lily and her friends loved playing games at recess. One day, their teacher gave them a new challenge: balance on one foot for as long as they could. Lily stood on her right foot and counted quietly. She wobbled a little but kept trying. Her friend Max started to lose balance and laughed as he fell gently on the grass. After a minute, Lily's teacher said, \"Great job! You all did your best.\" Lily felt proud because she stayed balanced the longest. From that day, Lily practiced balancing every day and got better and better."
  }
]