[
  {
    "grade": 2,
    "passage_code": "G2-001",
    "title": "Making a Collage: Fun with Paper and Glue",
    "text": "Making a collage is a fun way to play with art. You can use old magazines or colored paper. Some kids like cutting shapes, while others prefer tearing paper. Cutting gives sharp edges, but tearing makes soft, rough edges. Both ways create cool pictures. Using glue sticks is neat and easy, but liquid glue can be messy. No matter how you make it, a collage is a great way to show your creativity!"
  },
  {
    "grade": 2,
    "passage_code": "G2-002",
    "title": "Learning Cone Weaving",
    "text": "Tom: \"Look, Sara! We have to run around the cones.\" Sara: \"Yes! Weaving between cones helps us get faster.\" Tom: \"I will start on the left side of the first cone.\" Sara: \"Good idea! I will try to keep my balance.\" Tom: \"Let's race and see who finishes first!\" Sara: \"Ready, set, go!\" They weave quickly, having fun practicing their sports skills."
  },
  {
    "grade": 2,
    "passage_code": "G2-003",
    "title": "Setting the Table",
    "text": "Setting the table is an important part of mealtime. You need a plate, a fork, a spoon, and a cup for each person. Napkins help keep us clean. The fork goes on the left side of the plate. The spoon and knife go on the right side. Cups are placed at the top right. Setting the table helps everyone enjoy their food!"
  },
  {
    "grade": 2,
    "passage_code": "G2-004",
    "title": "Board Game Night",
    "text": "First, set up the board on the table. Next, choose your game pieces and place them on the start. Then, take turns rolling the dice. Move your piece the number you roll. If you land on a special spot, follow its instructions. Keep playing until someone reaches the finish line. Finally, cheer for the winner and get ready to play again!"
  },
  {
    "grade": 2,
    "passage_code": "G2-005",
    "title": "Shadows and Light",
    "text": "Light helps us see the world around us. When light shines on an object, it makes a shadow. A shadow is a dark shape made when something blocks the light. Shadows change size and shape depending on where the light comes from. If the light is low, the shadow looks long. If the light is high, the shadow looks short."
  },
  {
    "grade": 2,
    "passage_code": "G2-006",
    "title": "How Water Causes Erosion",
    "text": "Erosion happens when water moves soil and rocks from one place to another. When rain falls, it flows over the ground. The moving water carries tiny pieces of soil away. This causes the land to change shape over time. Rivers can also wash away soil, making valleys bigger. So, water causes erosion by moving soil and rocks, changing the land."
  },
  {
    "grade": 2,
    "passage_code": "G2-007",
    "title": "Retracing Your Steps",
    "text": "Sometimes, when you lose a toy or forget where you put something, you can find it by retracing your steps. This means you go back over the places you visited before. For example, if you lost your pencil, think about where you used it last. Walking back and looking carefully can help you find what you lost. It is a smart way to solve little problems every day!"
  },
  {
    "grade": 2,
    "passage_code": "G2-008",
    "title": "Birds and Their Wings",
    "text": "Lily loved watching birds in her backyard. One day, she saw a bluebird flap its wings quickly. She learned that birds use their wings to fly high in the sky. Some birds flap fast, while others glide smoothly. Wings help birds move, stay balanced, and even keep warm. Lily was excited to watch more birds and learn about their special wings."
  },
  {
    "grade": 2,
    "passage_code": "G2-009",
    "title": "Stopping Safely in Hockey",
    "text": "Coach: \"Remember, Alex, stopping safely is very important in hockey.\" Alex: \"How do I stop without falling?\" Coach: \"Use the snowplow stop. Point your toes inward and push your skates outwards gently.\" Alex: \"Like making a pizza slice with my skates?\" Coach: \"Exactly! That helps you slow down and stop safely.\" Alex: \"I will practice that to play better and stay safe!\""
  },
  {
    "grade": 2,
    "passage_code": "G2-010",
    "title": "The Cloud Adventure",
    "text": "One sunny day, Mia and her brother Tom looked up at the sky. They saw big, fluffy clouds called cumulus clouds. These clouds look like cotton balls! Then, they noticed thin, wispy clouds high up. These are cirrus clouds. Finally, dark clouds appeared. They are called nimbus clouds and bring rain. Mia and Tom learned that clouds come in different shapes and sizes. It was fun to watch the clouds and learn about them!"
  },
  {
    "grade": 2,
    "passage_code": "G2-011",
    "title": "Learning Cone Weaving Drills",
    "text": "Tom and his friends went to soccer practice. Today, their coach set up orange cones on the field. The cones were spaced out in a line. The coach said, \"We will do cone weaving drills!\" Tom ran fast, weaving in and out of the cones. He laughed and tried to go faster each time. The drills helped Tom control the ball better and made practice fun."
  },
  {
    "grade": 2,
    "passage_code": "G2-012",
    "title": "Origami: Easy Shapes to Play With",
    "text": "Origami is the art of folding paper to make fun shapes. Some shapes, like a paper boat, are very easy to make. You fold the paper just a few times, and it floats on water! Other shapes, like a paper crane, are harder and take more steps. Both are fun to play with, but easy shapes are great when you want quick playtime."
  },
  {
    "grade": 2,
    "passage_code": "G2-013",
    "title": "Canoeing Basics: Kayaks and Canoes",
    "text": "Canoeing and kayaking are fun sports on the water. A canoe is open on top, and you sit on a bench inside. A kayak is closed, and you sit low with your legs stretched out. Canoes use a single paddle, while kayaks use a double paddle. Both need safety gear like a life jacket. Both help you enjoy nature and stay active!"
  },
  {
    "grade": 2,
    "passage_code": "G2-014",
    "title": "Lily's First Hurdle Race",
    "text": "Lily was excited for her first track meet. She wanted to try the hurdles race. The hurdles were low and safe for kids. At the start, she felt a little nervous. When the whistle blew, Lily ran fast. She jumped over each hurdle carefully. At the finish line, Lily smiled big. She was happy she tried something new and had fun!"
  },
  {
    "grade": 2,
    "passage_code": "G2-015",
    "title": "The Pebble That Wanted to Skip",
    "text": "A small pebble lay by the pond. It wanted to skip across the water like the bigger stones. Because it practiced rolling in the grass, it became smooth and round. When a child came to the pond, she threw the pebble gently. Because the pebble was smooth and light, it skipped three times on the water. The pebble was happy because it finally could skip like it wanted!"
  },
  {
    "grade": 2,
    "passage_code": "G2-016",
    "title": "Listening to the Coach Helps Us Play Better",
    "text": "When we listen to the coach, we learn how to play the game the right way. The coach explains the rules and shows us new skills. Because we listen carefully, we can play better and help our team win. If we do not listen, we might make mistakes and lose the game. That is why listening to the coach is very important."
  },
  {
    "grade": 2,
    "passage_code": "G2-017",
    "title": "Wally the Helpful Wizard",
    "text": "\"Hello, Wally!\" said Mia. \"Can you help me find my lost cat?\" Wally smiled. \"Of course! I know a spell that shows where things are.\" He waved his wand and said, \"Find-o Cat-o!\" Suddenly, a soft meow came from the bushes. \"There she is!\" Mia cheered. \"Thank you, Wally!\" \"You're welcome,\" Wally said. \"I only know helpful spells to make friends happy!\""
  },
  {
    "grade": 2,
    "passage_code": "G2-018",
    "title": "How Fur and Feathers Help Animals",
    "text": "Animals have fur or feathers to help them live in their homes. When it is cold, fur keeps animals warm by trapping heat close to their bodies. Birds have feathers that protect them from the cold and help them fly. If the weather is hot, some animals shed fur or have thin feathers to stay cool. This shows how fur and feathers help animals survive in different places."
  },
  {
    "grade": 2,
    "passage_code": "G2-019",
    "title": "The Rainbow That Painted the Fence",
    "text": "One day, a rainbow came down from the sky to paint a fence. The rainbow used bright colors like red, blue, and yellow. The fence looked colorful and happy. Unlike plain fences, this one had many colors. The rainbow painted slowly and carefully. The fence was smooth, but the rainbow's colors made it look bright and fun. Both fences keep the garden safe, but the rainbow fence is much more beautiful."
  },
  {
    "grade": 2,
    "passage_code": "G2-020",
    "title": "Gus the Friendly Ghost",
    "text": "Gus was a ghost who lived in a big, old house. He was very friendly and loved to play with children. But Gus did not like scary stories. Whenever someone told a scary story, Gus would float away and hide. One day, the children told funny stories instead, and Gus came back. He laughed and played all afternoon. Gus loved happy stories the most!"
  },
  {
    "grade": 2,
    "passage_code": "G2-021",
    "title": "The Runaway Cookie",
    "text": "One day, a chocolate chip cookie named Chip did something funny. Chip didn't want to be eaten! When Mia reached for him, Chip jumped off the plate and rolled under the table. Chip said, \"I want to see the world, not a tummy!\" Mia laughed and promised to share Chip's adventure with her friends before eating him. What a silly cookie!"
  },
  {
    "grade": 2,
    "passage_code": "G2-022",
    "title": "Wally the Worm Wants a Library Card",
    "text": "Wally the worm wiggled up to the librarian. \"I want a library card,\" he said. \"But, Wally,\" said the librarian, \"you don't have hands to hold a book!\" Wally smiled. \"I don't read with hands. I read with my tummy!\" The librarian laughed. \"Okay, Wally, here's your card!\" Wally was so happy. He couldn't wait to read his first book!"
  },
  {
    "grade": 2,
    "passage_code": "G2-023",
    "title": "How to Solve a Small Disagreement",
    "text": "Sometimes, friends may have a small disagreement. First, take a deep breath to stay calm. Next, listen carefully to what the other person is saying. Then, use kind words to share your feelings. After that, think of a solution that makes everyone happy. Finally, say sorry if you need to and give a hug. Solving problems this way helps friends stay close and happy."
  },
  {
    "grade": 2,
    "passage_code": "G2-024",
    "title": "Why Listening Helps",
    "text": "When you listen carefully to directions, you know what to do. This helps you finish tasks faster. For example, if your teacher tells you how to draw a star, listening will help you draw it right. If you don't listen, you might make mistakes and have to start over. Listening is important because it makes learning easier and more fun."
  },
  {
    "grade": 2,
    "passage_code": "G2-025",
    "title": "Passing in Basketball: Bounce Pass vs. Chest Pass",
    "text": "In basketball, players use different passes to move the ball. The chest pass is quick and goes straight from one player's hands to another's hands. It is easy to catch but can be blocked by opponents. The bounce pass hits the floor before reaching a teammate. It is slower but harder for opponents to stop. Both passes help players work together to score points."
  },
  {
    "grade": 2,
    "passage_code": "G2-026",
    "title": "Ringette Basics: How It's Like and Unlike Hockey",
    "text": "Ringette is a fun winter sport that looks like hockey but is a little different. Both sports are played on ice and use sticks, but in ringette, players use a straight stick to move a rubber ring instead of a puck. Also, ringette has more players on the ice and focuses on passing the ring to teammates. Both games need teamwork and skating skills. So, ringette is like hockey because you skate a lot, but different because you use a ring and pass more."
  },
  {
    "grade": 2,
    "passage_code": "G2-027",
    "title": "How to Make Paper Chain Decorations",
    "text": "Making paper chain decorations is fun and easy. First, cut colorful paper into strips. Next, take one strip and make a loop. Use glue or tape to stick the ends together. Then, slide another strip through the loop and make a loop with it too. Repeat this until your chain is long. Finally, hang your paper chain to decorate your room!"
  },
  {
    "grade": 2,
    "passage_code": "G2-028",
    "title": "How to Be Safe and Respectful in Martial Arts Class",
    "text": "Step 1: Always listen to your instructor carefully. Step 2: Wear your uniform and gear to stay safe. Step 3: Practice moves slowly and gently with your partner. Step 4: Use kind words and be respectful to everyone. Step 5: Keep your hands to yourself unless your teacher says to practice. Following these steps helps everyone have fun and learn martial arts safely."
  },
  {
    "grade": 2,
    "passage_code": "G2-029",
    "title": "The Shy Unicorn at the Festival",
    "text": "\"Hello, Sparkle!\" said Mia. \"Are you coming to the festival?\" Sparkle the unicorn looked down shyly. \"I'm a little scared,\" she whispered. \"Don't be shy! Everyone is friendly,\" Mia smiled. Sparkle took a deep breath. \"Okay, I'll try.\" At the festival, Sparkle saw lots of happy friends. She smiled and said, \"This is fun!\" Mia hugged Sparkle. \"See? You're not alone!\""
  },
  {
    "grade": 2,
    "passage_code": "G2-030",
    "title": "Practice Spelling Words Every Day",
    "text": "Learning to spell is fun! When you practice spelling words every day, your brain gets stronger. Start with easy words like cat, dog, and sun. Say each word out loud and write it down three times. You can also use colorful markers to make it fun. Remember, the more you practice, the better you get. Keep trying, and soon you will be a spelling star!"
  },
  {
    "grade": 2,
    "passage_code": "G2-031",
    "title": "How to Run a Lap",
    "text": "Running a lap is fun and easy! First, stand at the starting line. Next, get ready by bending your knees and leaning forward a little. When you hear 'Go,' start running fast but steady. Keep your arms moving back and forth to help you run. Finally, run all the way around the track until you reach the starting line again. Great job! You just ran a lap!"
  },
  {
    "grade": 2,
    "passage_code": "G2-032",
    "title": "How Volcanoes Work Safely",
    "text": "Volcanoes are mountains that can sometimes erupt with lava. Step 1: Inside the Earth, hot melted rock called magma moves up. Step 2: When the magma reaches the surface, it flows out as lava. Step 3: After the lava cools, it becomes hard rock. Step 4: People watch volcanoes carefully to stay safe. Volcanoes help form new land and are part of how our Earth changes."
  },
  {
    "grade": 2,
    "passage_code": "G2-033",
    "title": "How Pushes and Pulls Work",
    "text": "Step 1: Find a toy car. Step 2: Give the car a push with your hand. The car moves forward because of the push. Step 3: Now, pull the car back toward you. The car moves closer because of the pull. Step 4: Try pushing or pulling different things around you. You will see that pushes and pulls help objects move."
  },
  {
    "grade": 2,
    "passage_code": "G2-034",
    "title": "Bobby Broccoli's Big Song",
    "text": "\"I want to sing!\" said Bobby Broccoli. \"But you are a vegetable,\" laughed Carrot. \"That doesn't stop me,\" Bobby said. \"Watch this!\" He opened his mouth wide and made funny noises. \"You sound like a robot,\" giggled Tomato. \"Maybe,\" said Bobby, \"but I will keep singing until I sound like a star!\" Everyone clapped and cheered for Bobby's silly song."
  },
  {
    "grade": 2,
    "passage_code": "G2-035",
    "title": "Why Do Nocturnal Animals Sleep During the Day?",
    "text": "Nocturnal animals are awake at night and sleep during the day. This happens because it is cooler and quieter at night. When it is dark, these animals can find food easily and stay safe from predators. For example, owls hunt for mice in the dark. Because of this, many animals choose to be active at night instead of during the day."
  },
  {
    "grade": 2,
    "passage_code": "G2-036",
    "title": "The Tiny Fairy's Missing Shoes",
    "text": "\"Where are my shoes?\" said Tilly the tiny fairy. She looked under a big leaf. \"Not here,\" she sighed. \"Did you see my shoes?\" she asked Benny the butterfly. \"No, I didn't,\" Benny said. \"Maybe the wind took them!\" Tilly flew around, searching high and low. Suddenly, she heard a giggle. \"Found them!\" said a little squirrel, holding her sparkling shoes. \"Thank you!\" Tilly smiled and danced in her shiny shoes."
  },
  {
    "grade": 2,
    "passage_code": "G2-037",
    "title": "Learning to Play Chess",
    "text": "Anna wanted to learn a new game. Her friend Leo showed her how to play chess. They used a board with black and white squares and small pieces. Each piece moves differently. Anna liked the knight because it jumps over other pieces. They took turns moving pieces and tried to protect their king. Playing chess made Anna think hard and have fun."
  },
  {
    "grade": 2,
    "passage_code": "G2-038",
    "title": "Fun with Origami Shapes",
    "text": "When you fold paper to make origami shapes, you can create fun toys. If you fold a paper square into a triangle, it becomes a paper hat. When you fold it differently, it can turn into a paper boat. Because you play with these shapes, you learn how to follow steps and use your hands. This makes play time both fun and helpful."
  },
  {
    "grade": 2,
    "passage_code": "G2-039",
    "title": "Bones and Muscles Work Together",
    "text": "Tom: Why do we have bones? Anna: Bones help us stand up and protect our body. Tom: What about muscles? Anna: Muscles help us move! They pull on bones when we walk, run, or jump. Tom: So, bones and muscles are like a team? Anna: Yes! Bones give shape, and muscles help us move. They work together to keep us strong!"
  },
  {
    "grade": 2,
    "passage_code": "G2-040",
    "title": "Drawing Animals is Fun!",
    "text": "Drawing animals is a fun way to play and learn. You can use pencils, crayons, or markers to make your pictures bright and colorful. Start with simple shapes like circles and ovals. Then, add legs, ears, and tails to make your animal come alive. Try drawing a cat, dog, or even a bird! Drawing animals helps your imagination grow and makes playtime exciting."
  },
  {
    "grade": 2,
    "passage_code": "G2-041",
    "title": "Playing Defense in Basketball",
    "text": "In basketball, defense means trying to stop the other team from scoring. Players stay close to their opponent to block shots and passes. Good defense helps your team win games. It is important to watch the player with the ball and move your feet quickly to stay in front of them. Playing defense is fun and helps you be a great teammate."
  },
  {
    "grade": 2,
    "passage_code": "G2-042",
    "title": "Why Do We Have Seasons?",
    "text": "The Earth is tilted as it moves around the sun. Because of this tilt, different parts of Earth get more sunlight at different times of the year. When your part of Earth leans toward the sun, it is summer and it feels warm. When it leans away, it is winter and it feels cold. This is why we have seasons."
  },
  {
    "grade": 2,
    "passage_code": "G2-043",
    "title": "The Wind That Moves the Sand",
    "text": "One windy day, Mia visited the beach with her family. She saw how the strong wind blew the sand in little waves. The wind picked up tiny grains of sand and moved them across the shore. This is called erosion by wind. It changes the shape of the land slowly over time. Mia was amazed to learn that the wind can sculpt nature just like a painter."
  },
  {
    "grade": 2,
    "passage_code": "G2-044",
    "title": "Lily and Max Learn to Recycle",
    "text": "Lily: Max, do you know why we sort our trash? Max: Not really. Why? Lily: Because recycling helps save the Earth! Max: How do we do that? Lily: We put paper in the blue bin, plastic in the green one, and glass in the yellow bin. Max: That sounds easy! I want to help. Lily: Great! Together, we can keep our planet clean."
  },
  {
    "grade": 2,
    "passage_code": "G2-045",
    "title": "Folding Towels",
    "text": "Folding towels is an easy chore that helps keep things neat. First, you lay the towel flat. Then, fold it in half from top to bottom. Next, fold it in half from side to side. Finally, place the towel on a shelf or in a basket. Folding towels helps your room look tidy and makes it easy to find them when you need one."
  },
  {
    "grade": 2,
    "passage_code": "G2-046",
    "title": "The Cloud Adventure",
    "text": "One day, Mia looked up at the sky. She saw fluffy white clouds called cumulus clouds. They looked like big cotton balls! Then, she noticed thin, wispy clouds high above. These were cirrus clouds, which mean the weather might change. Finally, dark clouds covered the sky. These nimbostratus clouds bring rain. Mia learned that clouds come in different shapes and tell us about the weather!"
  },
  {
    "grade": 2,
    "passage_code": "G2-047",
    "title": "Playing with Tongue Twisters",
    "text": "Playing with tongue twisters is fun! Some tongue twisters use soft sounds, like \"she sells sea shells.\" Others use hard sounds, like \"big black bugs.\" Soft sounds are smooth and gentle, while hard sounds are sharp and strong. Both kinds can make your mouth move in funny ways. You can make up your own tongue twisters with soft or hard sounds. Which do you like more?"
  },
  {
    "grade": 2,
    "passage_code": "G2-048",
    "title": "Learning to Play the Piano",
    "text": "Mom: \"Do you want to learn to play the piano?\" Tom: \"Yes! How do I start?\" Mom: \"First, find the middle C. It's in the center of the keyboard.\" Tom: \"I see it! What's next?\" Mom: \"Next, try pressing the white keys one by one. Listen to the sounds.\" Tom: \"This is fun! I want to play a song.\" Mom: \"Great! We will practice simple songs soon.\""
  },
  {
    "grade": 2,
    "passage_code": "G2-049",
    "title": "How Fish Breathe",
    "text": "Lily: How do fish breathe underwater? Tom: Fish use gills to breathe. Gills take oxygen from the water. Lily: Like our lungs? Tom: Sort of! Gills pull oxygen from water, just like lungs pull oxygen from air. Lily: That's cool! So fish never need to come up for air? Tom: Some fish do, but most get all their oxygen through their gills."
  },
  {
    "grade": 2,
    "passage_code": "G2-050",
    "title": "Fun on the Slide",
    "text": "Tom and Mia went to the park to play. They saw a big slide and decided to try it. First, they waited in line. Then, Mia climbed the ladder carefully. She sat at the top and slid down with a big smile. Tom followed, making sure to hold the sides. They both played safely and had lots of fun on the slide."
  },
  {
    "grade": 2,
    "passage_code": "G2-051",
    "title": "Sharing Sports Equipment",
    "text": "In sports, sharing equipment is important. Some sports use balls, like soccer and basketball. Soccer balls are bigger and lighter. Basketballs are smaller and heavier. Players need to share these balls to practice and play. On the other hand, tennis and baseball use rackets and bats. Tennis rackets are light and easy to hold. Baseball bats are heavier and longer. Sharing these helps friends play together and have fun."
  },
  {
    "grade": 2,
    "passage_code": "G2-052",
    "title": "Learning the Tennis Backhand",
    "text": "In tennis, the backhand is an important way to hit the ball. It is done with the back of your hand facing the net. To hit a backhand, hold the racket with both hands and swing it across your body. This stroke helps players return balls that come to their non-dominant side. Practicing the backhand makes you a better tennis player!"
  },
  {
    "grade": 2,
    "passage_code": "G2-053",
    "title": "Sorting Trash and Recycling",
    "text": "Anna and Ben are at the park. Anna says, \"Look! This bottle can be recycled.\" Ben asks, \"How do we do that?\" Anna smiles, \"We put bottles in the blue bin.\" Ben nods, \"And trash goes in the black bin?\" \"Yes! Recycling helps the Earth stay clean,\" Anna explains. \"I will sort my trash and recycling every day!\" Ben says."
  },
  {
    "grade": 2,
    "passage_code": "G2-054",
    "title": "Cheering for Your Teammates",
    "text": "Playing sports is fun, but sometimes it can be hard. When your teammate misses a goal, you can feel sad or upset. Some players get quiet, while others cheer loudly. Cheering helps your teammate try harder and feel happy. It is good to encourage each other, even if you win or lose. Being kind makes the game better for everyone."
  },
  {
    "grade": 2,
    "passage_code": "G2-055",
    "title": "Making a Safe Marble Run",
    "text": "Making a marble run is fun! First, gather safe materials like cardboard tubes and tape. Next, cut the tubes to different lengths. Then, use tape to stick the tubes on a board or wall, slanting them down. Make sure the tubes are secure so marbles won't fall out. Finally, drop a marble at the top and watch it roll down. Remember to play safely and ask an adult for help!"
  },
  {
    "grade": 2,
    "passage_code": "G2-056",
    "title": "Baking Cookies Together",
    "text": "Lily and her dad decided to bake cookies. First, they measured the flour and sugar. Lily stirred the mix while her dad cracked the eggs. They laughed as the dough got sticky. Then, they shaped the cookies and put them on the tray. After baking, the cookies smelled sweet and yummy. Lily felt happy to help and share the treats with her family."
  },
  {
    "grade": 2,
    "passage_code": "G2-057",
    "title": "Family Movie Night Fun",
    "text": "Every family has a special way to enjoy movie night. Some families like to watch funny cartoons, while others choose exciting adventure films. In my family, we like both! We also snack differently. My sister loves popcorn with cheese, but I prefer sweet candy. Even though we pick different movies and treats, we all have fun together. Family movie night is a happy time for everyone!"
  },
  {
    "grade": 2,
    "passage_code": "G2-058",
    "title": "Finn the Fish Learns to Blow Bubbles",
    "text": "Finn was a little fish who wanted to play with his friends. But he didn't know how to blow bubbles like they did. He tried many times, but only made small splashes. One day, Finn watched his friend carefully and practiced every day. Because he kept trying, Finn finally learned to blow big, shiny bubbles. Now, he plays happily with his friends in the water."
  },
  {
    "grade": 2,
    "passage_code": "G2-059",
    "title": "How to Turn While Skating",
    "text": "Turning while skating is fun and easy if you follow these steps. First, bend your knees slightly to keep your balance. Second, look in the direction you want to go. Third, lean your body a little to the side. Finally, use your feet to guide your movement and make the turn smooth. Practice these steps and you will turn like a pro!"
  },
  {
    "grade": 2,
    "passage_code": "G2-060",
    "title": "Sing-Along Time Fun",
    "text": "Playing is fun, and singing is fun too! When you play outside, you run and jump. When you sing, you use your voice and smile. Playing helps your body get strong. Singing helps your heart feel happy. Both playing and singing make you feel good. Sometimes, you can play games with friends. Other times, you can sing songs with family. Both are great ways to have fun and enjoy your time!"
  },
  {
    "grade": 2,
    "passage_code": "G2-061",
    "title": "Brushing Teeth Together",
    "text": "Mom: Time to brush your teeth! Did you eat your lunch? Lily: Yes, Mom. My teeth feel sticky. Mom: That's why we brush twice a day. It keeps your smile bright! Lily: Can I use the strawberry toothpaste? Mom: Of course! Let's brush for two minutes. Up and down, round and round. Lily: I like brushing with you. My teeth feel clean now!"
  },
  {
    "grade": 2,
    "passage_code": "G2-062",
    "title": "Playing the Matching Card Game",
    "text": "Anna: Let's play the matching card game! Ben: Great! How do we play? Anna: We take turns flipping two cards. If they match, you keep them. Ben: What if they don't match? Anna: Then we turn them back over, and it's the next player's turn. Ben: Sounds fun! I hope I find a match soon! Anna: Me too! Let's start!"
  },
  {
    "grade": 2,
    "passage_code": "G2-063",
    "title": "Anna's Watercolor Adventure",
    "text": "Anna loves to play with her new watercolor paints. One sunny afternoon, she set up her paper and brushes on the table. She dipped her brush in bright blue and painted a big, shiny sky. Then, she added green trees and red flowers. Anna smiled as the colors mixed and danced on the paper. Painting with watercolors was her favorite kind of play!"
  },
  {
    "grade": 2,
    "passage_code": "G2-064",
    "title": "Food Chains: Who Eats Whom?",
    "text": "In a food chain, animals eat plants or other animals to get energy. A rabbit eats grass, but a fox eats the rabbit. Both the rabbit and the fox need food, but they eat different things. Plants make their own food from sunlight, while animals get food by eating plants or other animals. This shows how living things depend on each other in nature."
  },
  {
    "grade": 2,
    "passage_code": "G2-065",
    "title": "Learning Rink Rules",
    "text": "When you go to the ice rink, it's important to learn the rules. First, always wear your helmet to stay safe. Next, skate in the same direction as others to avoid crashes. Then, keep your hands out of your pockets to help balance. Finally, listen to the coach or rink staff for more tips. Following these steps helps everyone have fun and stay safe on the ice."
  },
  {
    "grade": 2,
    "passage_code": "G2-066",
    "title": "Making Paper Chain Decorations",
    "text": "Lily and her brother Max wanted to decorate their room for a party. They took colorful paper and cut it into strips. Then, they linked the strips together to make a long paper chain. Max helped by holding the chain while Lily added more links. Soon, their room looked bright and cheerful with the paper chains hanging from the ceiling."
  },
  {
    "grade": 2,
    "passage_code": "G2-067",
    "title": "Building a Bridge with Blocks",
    "text": "First, gather all your blocks and find a flat surface. Next, place two blocks standing up with some space between them. Then, carefully put a block across the top to connect the two sides. Keep adding blocks to make your bridge longer and stronger. Finally, test your bridge by gently placing a toy car on it to see if it holds!"
  },
  {
    "grade": 2,
    "passage_code": "G2-068",
    "title": "The Mystery of the Missing Sticker",
    "text": "Lily loved collecting stickers. One day, she noticed her favorite shiny star sticker was missing from her book. She looked under the bed and behind the door, but it was gone! Then, she heard a tiny giggle. It was her little brother, Max, holding the sticker. He wanted to play detective and hide it for a surprise. Lily smiled and gave him a big hug."
  },
  {
    "grade": 2,
    "passage_code": "G2-069",
    "title": "The Rainbow That Lost a Color",
    "text": "One day, a bright rainbow appeared in the sky. But suddenly, the color blue started to fade. The blue paint on the rainbow mixed with the clouds because it was very windy. Because the blue color disappeared, the rainbow looked different and some animals felt sad. Then, the sun smiled and helped the blue color come back. The rainbow became bright again!"
  },
  {
    "grade": 2,
    "passage_code": "G2-070",
    "title": "Playing a Small-Sided Scrimmage",
    "text": "Coach: Today, we will play a small-sided scrimmage. That means fewer players on each team. Lily: How many players are on each side? Coach: Just four players per team. This helps everyone get more chances to play. Tom: That sounds fun! I can run more and score goals. Coach: Yes, Tom! It's a great way to practice skills and work together."
  },
  {
    "grade": 2,
    "passage_code": "G2-071",
    "title": "The Talking Backpack",
    "text": "Step 1: Mia went to school with her new backpack. Step 2: Suddenly, the backpack said, \"Hello!\" Step 3: Mia was surprised but happy to have a talking friend. Step 4: The backpack helped Mia find her books. Step 5: At lunchtime, the backpack told funny stories. Step 6: Mia loved her magical backpack and looked forward to school every day."
  },
  {
    "grade": 2,
    "passage_code": "G2-072",
    "title": "What Are Tides?",
    "text": "Tides are the rise and fall of ocean water. They happen because the Moon pulls on the water with its gravity. When the Moon is close, the water rises and makes a high tide. When the Moon moves away, the water falls and makes a low tide. Tides help sea animals live and play by moving water around the shore."
  },
  {
    "grade": 2,
    "passage_code": "G2-073",
    "title": "A Paper Boat's Tiny Adventure",
    "text": "Lily made a paper boat and placed it in a small puddle. The boat was quiet and calm in the puddle. Then, she moved it to a fast, bubbling stream. The boat moved quickly there, bumping over rocks. In the puddle, the boat stayed still and safe. In the stream, it had a wild adventure. Both places were fun for the little paper boat, but very different!"
  },
  {
    "grade": 2,
    "passage_code": "G2-074",
    "title": "The Wizard's Magic Soup and Stew",
    "text": "Tim the wizard loved to cook. One day, he made a big pot of soup. It was light and watery. Then, Tim waved his magic wand. The soup changed! It became thick and full of vegetables. Tim called it stew. Soup is thin and easy to drink. Stew is thick and you eat it with a spoon. Tim liked both, but stew was his favorite because it was warm and filling."
  },
  {
    "grade": 2,
    "passage_code": "G2-075",
    "title": "Team Cheers: Loud and Quiet",
    "text": "Team cheers help players feel excited and ready to play. Some teams use loud cheers with clapping and stomping. These cheers make the players feel strong and happy. Other teams use quiet cheers with soft words and hand signs. These cheers help players focus and stay calm. Both loud and quiet cheers show support for the team in different ways."
  },
  {
    "grade": 2,
    "passage_code": "G2-076",
    "title": "Flashlight Shadow Game",
    "text": "Playing with a flashlight can be fun and safe! In a dark room, shine the flashlight on your hand. You will see a shadow on the wall. Move your hand slowly to change the shadow's shape. You can make animals, letters, or funny shapes. Always ask an adult before playing with a flashlight. This game helps you learn about light and shadows while having fun!"
  },
  {
    "grade": 2,
    "passage_code": "G2-077",
    "title": "Painting with Watercolors",
    "text": "Watercolor painting is a fun way to play with colors. You use a brush and water to make paint flow on paper. The colors mix and blend to make beautiful pictures. You can paint anything you like, such as flowers, animals, or the sky. Watercolors can be light or dark depending on how much water you use. It's a creative game that helps you learn about colors and shapes!"
  },
  {
    "grade": 2,
    "passage_code": "G2-078",
    "title": "The Magic Picture Book",
    "text": "Step 1: Mia found a book in her attic. It had no words, only blank pages. Step 2: When Mia touched the pages, pictures began to appear! Step 3: The pictures changed every time she turned a page. Step 4: Mia smiled because the magic book was safe and fun. Step 5: She shared her magic book with her friends, and they all enjoyed the changing pictures together."
  },
  {
    "grade": 2,
    "passage_code": "G2-079",
    "title": "How to Ask for Help",
    "text": "Sometimes, we need help when we can't do something alone. First, look for a grown-up or a friend nearby. Next, say clearly what you need help with, like \"Can you help me with this puzzle?\" Then, listen carefully to their advice. Finally, say thank you for their help. Asking for help is a good way to learn and solve problems!"
  },
  {
    "grade": 2,
    "passage_code": "G2-080",
    "title": "Finn the Fish Learns to Blow Bubbles",
    "text": "Finn is a small fish who lives in a big pond. One day, Finn sees other fish blowing bubbles. He wants to try too! Step 1: Finn opens his mouth wide. Step 2: He takes a deep breath underwater. Step 3: Finn blows air gently from his mouth. Pop! A bubble appears. Finn is happy and shows his new skill to his friends."
  },
  {
    "grade": 2,
    "passage_code": "G2-081",
    "title": "The Giggle Spell",
    "text": "One day, Lily found a shiny book in the forest. It had a special spell that made everyone giggle! She read the magic words aloud, and suddenly, all the children began to laugh happily. Even the grumpy cat giggled! The spell was safe and filled the town with joy. Everyone loved the giggle spell because it made their day bright and cheerful."
  },
  {
    "grade": 2,
    "passage_code": "G2-082",
    "title": "Jumping Over Hurdles",
    "text": "Tom: Look at these low hurdles! Are they safe for kids? Lily: Yes, they are! We just need to jump over them carefully. Tom: I'm a little nervous. What if I trip? Lily: It's okay! If you do trip, the hurdles will fall down. They are soft and made for kids. Tom: Great! Let's race and see who jumps the best. Lily: Ready, set, go!"
  },
  {
    "grade": 2,
    "passage_code": "G2-083",
    "title": "Building with Magnet Tiles",
    "text": "Playing with magnet tiles is fun and different from playing with blocks. Magnet tiles stick together because of magnets, but blocks just stack. Magnet tiles can make flat shapes or tall towers easily. Blocks can be harder to balance but feel solid. Both are great for building, but magnet tiles can snap together quickly, while blocks might fall more often."
  },
  {
    "grade": 2,
    "passage_code": "G2-084",
    "title": "Chalk Drawing Fun",
    "text": "\"Look at my rainbow!\" said Mia as she held up a piece of pink chalk. \"Wow! Can I try?\" asked Ben. \"Sure!\" Mia smiled. Ben drew a big sun. \"Your sun looks bright!\" said Mia. They laughed and drew flowers, stars, and even a big house on the sidewalk. \"It's fun to play with chalk,\" said Ben. \"Yes, it makes the sidewalk colorful!\" Mia added."
  },
  {
    "grade": 2,
    "passage_code": "G2-085",
    "title": "The Life Cycle of a Butterfly",
    "text": "Lily: Look, Tom! A butterfly is flying nearby. Tom: Wow! Do you know how butterflies grow? Lily: Yes! First, a butterfly lays eggs on a leaf. Tom: Then, a tiny caterpillar hatches from the egg. Lily: The caterpillar eats leaves and grows big. Tom: Next, it makes a chrysalis, called a pupa. Lily: Inside, it changes into a butterfly! Tom: Finally, the butterfly comes out and flies away. Lily: That's an amazing life cycle!"
  },
  {
    "grade": 2,
    "passage_code": "G2-086",
    "title": "Making Fun Animals with Pipe Cleaners",
    "text": "First, take a few colorful pipe cleaners. Twist one pipe cleaner into a circle to make the animal's head. Next, bend other pipe cleaners to form the body, legs, and tail. You can wrap smaller pieces around the body to add ears or eyes. Finally, shape the legs so the animal can stand. Now you have a fun, fuzzy animal to play with!"
  },
  {
    "grade": 2,
    "passage_code": "G2-087",
    "title": "Lily Learns to Balance on Her Skateboard",
    "text": "Lily got a new skateboard for her birthday. She was excited to try it at the park. At first, she wobbled and almost fell. Her friend Max showed her how to stand with her feet apart and bend her knees a little. Lily practiced every day. Soon, she could balance and ride smoothly. She felt proud and happy to skate like a pro!"
  },
  {
    "grade": 2,
    "passage_code": "G2-088",
    "title": "How to Serve in Tennis",
    "text": "Serving is how a tennis game starts. To serve, hold the ball in one hand and the racket in the other. Toss the ball up in the air. Then, hit the ball with the racket before it falls. The ball must go over the net and into the other side of the court. Serving well helps you start the game strong!"
  },
  {
    "grade": 2,
    "passage_code": "G2-089",
    "title": "I Feel Happy and I Feel Sad",
    "text": "I feel happy when I play with my friends. I smile and laugh a lot. But I feel sad when I lose my toy. I might cry or feel quiet. Happy feelings make me want to run and jump. Sad feelings make me want to sit and think. Both feelings are okay, and I can say, \"I feel happy\" or \"I feel sad.\""
  },
  {
    "grade": 2,
    "passage_code": "G2-090",
    "title": "Clearing the Table: Kids vs. Adults",
    "text": "Clearing the table is a helpful chore. Kids and adults both clear the table, but they do it differently. Kids often carry one plate at a time and sometimes drop crumbs. Adults usually carry many dishes carefully and wipe the table clean. Both kids and adults work to keep the table neat, but adults are usually faster and tidier. Even though they do it differently, everyone helps in their own way!"
  },
  {
    "grade": 2,
    "passage_code": "G2-091",
    "title": "Playing the Matching Card Game",
    "text": "Lily and her brother Jake like to play a card game. They spread all the cards face down on the table. Each player takes turns flipping two cards. If the cards match, the player keeps them. If not, they turn the cards back over. Lily loves finding pairs and winning the game. It is fun to play and makes them both smile."
  },
  {
    "grade": 2,
    "passage_code": "G2-092",
    "title": "Practice in the Backyard",
    "text": "Playing sports is fun! First, find a safe space in your backyard. Next, gather your equipment like a ball, bat, or gloves. Then, warm up by stretching your arms and legs. After that, practice your skills by throwing, catching, or hitting the ball. Finally, take breaks and drink water to stay healthy. Practicing in the backyard helps you get better and have fun!"
  },
  {
    "grade": 2,
    "passage_code": "G2-093",
    "title": "Fun on the Slide",
    "text": "Tom and Mia went to the park to play. They saw a big slide and ran to it quickly. First, Tom climbed the ladder carefully. Then, he sat down and slid down fast! Mia clapped and waited her turn. When it was her turn, she held the sides tightly and slid down safely. They laughed and played all afternoon. Playing on the slide is fun and safe when you follow the rules."
  },
  {
    "grade": 2,
    "passage_code": "G2-094",
    "title": "Using a Compass: North or South?",
    "text": "A compass helps us find directions. The red needle always points north. When you hold a compass, the needle moves but stops pointing north. Unlike a map, a compass shows directions by using Earth's magnetic field. A map shows places, but a compass shows where you are facing. Both help you find your way, but a compass uses needles, and a map uses pictures."
  },
  {
    "grade": 2,
    "passage_code": "G2-095",
    "title": "Board Game Night",
    "text": "On Friday night, Mia and her family played board games. They chose a game with colorful cards and fun pieces. Mia rolled the dice and moved her token. She laughed when she won the first round! Everyone cheered and took turns. After the game, they talked about their favorite parts. It was a happy night full of fun and smiles."
  },
  {
    "grade": 2,
    "passage_code": "G2-096",
    "title": "Fun at the Obstacle Course",
    "text": "First, you start by climbing over the big blue wall. Next, you crawl through the tunnel on your hands and knees. Then, you jump over the soft red blocks. After that, you balance on the thin beam without falling. Finally, you run to the finish line and cheer for yourself! The obstacle course at the gym is fun and helps you get strong and fast."
  },
  {
    "grade": 2,
    "passage_code": "G2-097",
    "title": "How to Make a Rubber-Band Guitar",
    "text": "Making a rubber-band guitar is fun and safe! First, find a small box. Next, stretch a few rubber bands around the box. Make sure the bands are tight but not too tight. Then, pluck the rubber bands with your fingers to play sounds. You can try different rubber bands to hear high and low notes. Now you have a cool rubber-band guitar to play with!"
  },
  {
    "grade": 2,
    "passage_code": "G2-098",
    "title": "The Helpful Stem",
    "text": "Lily loved watching her garden grow. One day, she asked her dad, \"What does the stem do?\" Dad smiled and said, \"The stem is like a straw. It carries water and food from the roots to the leaves and flowers. It also holds the plant up so it can reach the sun.\" Lily touched the stems and saw how strong they were. \"Stems help plants stand tall!\" she said happily."
  },
  {
    "grade": 2,
    "passage_code": "G2-099",
    "title": "Refilling the Water Bowl",
    "text": "Lily noticed that her dog's water bowl was almost empty. She decided to help. First, she carried the bowl to the kitchen sink. Then, she turned on the tap and filled the bowl with fresh, cool water. Finally, she placed the bowl back on the floor. Her dog wagged its tail happily and took a big drink. Lily felt proud to help keep her pet healthy and happy."
  },
  {
    "grade": 2,
    "passage_code": "G2-100",
    "title": "How Seeds Sprout",
    "text": "Seeds grow into plants when they get water and sunlight. When a seed is planted in the soil and watered, it begins to sprout. The water makes the seed swell, and the sunlight helps the tiny plant inside grow. Because of these things, the seed breaks open and a small sprout appears. This is how new plants start to grow."
  }
]