[
  {
    "grade": 1,
    "passage_code": "G1-001",
    "title": "Milo's Big Idea",
    "text": "\"I have an idea!\" said Milo the mouse. \"Let's build a paper boat.\" His friend Bella asked, \"Will it float?\" Milo smiled, \"Let's try and see!\" They watched the boat sail across the pond. \"It works!\" cheered Bella. \"Great idea, Milo!\""
  },
  {
    "grade": 1,
    "passage_code": "G1-002",
    "title": "Dribbling in Soccer",
    "text": "Dribbling is a way to move the soccer ball using your feet. Players tap the ball gently to keep it close. Dribbling helps you control the ball and move past other players."
  },
  {
    "grade": 1,
    "passage_code": "G1-003",
    "title": "Balancing on a Skateboard",
    "text": "Balancing on a skateboard is like riding a bike. Both need you to stay steady. On a bike, you sit and pedal. On a skateboard, you stand and roll. Both are fun ways to move!"
  },
  {
    "grade": 1,
    "passage_code": "G1-004",
    "title": "Writing a Silly Riddle",
    "text": "Sam and Mia like to write riddles. Sam writes about a cat, and Mia writes about a hat. A cat can purr, but a hat cannot. A hat can sit on your head, but a cat jumps off! Their riddles are silly and fun because they are different but both make everyone giggle."
  },
  {
    "grade": 1,
    "passage_code": "G1-005",
    "title": "The Swing That Wanted to Fly",
    "text": "Sara loved to play on the swing in her yard. One day, the swing said, \"I wish I could fly!\" Sara giggled and pushed higher. The swing felt like it was flying in the sky. They laughed together, happy to soar safely."
  },
  {
    "grade": 1,
    "passage_code": "G1-006",
    "title": "The Tiny Spaceship",
    "text": "\"Look, Mia!\" said Ben. \"There is a tiny spaceship in my lunchbox!\" Mia peered inside. \"Wow! Do you think it came from space?\" Ben smiled. \"Let's pretend we are astronauts!\""
  },
  {
    "grade": 1,
    "passage_code": "G1-007",
    "title": "How to Balance on a Snowboard",
    "text": "Step 1: Stand with your feet apart on the board. Step 2: Bend your knees a little. Step 3: Hold your arms out to help balance. Step 4: Look ahead and smile!"
  },
  {
    "grade": 1,
    "passage_code": "G1-008",
    "title": "Washing Fruits",
    "text": "When we wash fruits, we remove dirt and germs. This helps keep us healthy. If we do not wash fruits, we might get sick. Clean fruits taste fresh and are safe to eat."
  },
  {
    "grade": 1,
    "passage_code": "G1-009",
    "title": "Casey the Carrot's Skateboard Dream",
    "text": "Casey is a bright orange carrot. Casey wants to skateboard! He puts on a tiny helmet. He rolls down the ramp. Whee! Casey laughs and does a silly spin. Skateboarding carrots are full of fun!"
  },
  {
    "grade": 1,
    "passage_code": "G1-010",
    "title": "Carrying a Small Bag",
    "text": "Anna has a small bag. It is light and easy to carry. Her brother has a big bag. His bag is heavy and hard to carry. Anna's small bag is safer for her because she can hold it well. Big bags can be too heavy for kids. Small bags help kids stay safe and comfortable."
  },
  {
    "grade": 1,
    "passage_code": "G1-011",
    "title": "Making a Marble Run",
    "text": "Let's make a marble run! First, find some empty paper tubes. Next, tape them to a wall or a box. Make sure they are safe and strong. Now, drop a marble at the top. Watch it roll down. Have fun playing and building!"
  },
  {
    "grade": 1,
    "passage_code": "G1-012",
    "title": "Sorting Buttons by Color",
    "text": "First, look at all the buttons. Next, put the red buttons in one pile. Then, put the blue buttons in another pile. Last, check your groups. Great job sorting the buttons by color!"
  },
  {
    "grade": 1,
    "passage_code": "G1-013",
    "title": "Roots Help Plants Grow",
    "text": "Roots are different from stems. Roots grow under the ground, but stems grow above the soil. Roots hold the plant in place and help it drink water. Stems help the plant stand tall."
  },
  {
    "grade": 1,
    "passage_code": "G1-014",
    "title": "Carrie the Carrot's Skateboard Dream",
    "text": "Carrie is a carrot. Most carrots like to stay in the garden, but Carrie wants to skateboard! Unlike her carrot friends, Carrie loves to roll fast and do tricks. While other carrots dig in the dirt, Carrie spins around the skatepark. Carrie is a very silly carrot!"
  },
  {
    "grade": 1,
    "passage_code": "G1-015",
    "title": "The Coloring Contest",
    "text": "Sara and Ben joined a coloring contest. Sara used bright colors, while Ben chose only blue. Both made pretty pictures, but their styles were different. They had fun sharing their art!"
  },
  {
    "grade": 1,
    "passage_code": "G1-016",
    "title": "Writing a Short Poem",
    "text": "Writing a poem can be fun! Poems use words to show feelings and ideas. You can rhyme words like cat and hat. Try to write a poem about your favorite game or toy. Remember, poems can be short and sweet!"
  },
  {
    "grade": 1,
    "passage_code": "G1-017",
    "title": "Hedgehog's Tea Party",
    "text": "Hazel the hedgehog loves making friends. One sunny day, she invited Bunny, Squirrel, and Mouse for tea in her garden. They ate cake and drank berry tea. Everyone laughed and had fun!"
  },
  {
    "grade": 1,
    "passage_code": "G1-018",
    "title": "The Puzzle Challenge",
    "text": "Sam and Mia played with a big puzzle. They worked together to fit the pieces. Because they did not give up, they finished the puzzle. This made them very happy."
  },
  {
    "grade": 1,
    "passage_code": "G1-019",
    "title": "The Puppet Show",
    "text": "Sarah made puppets with her friends. They put on a puppet show for the class. Because everyone worked together, the show was funny and made the children clap and smile."
  },
  {
    "grade": 1,
    "passage_code": "G1-020",
    "title": "Going to the Pool",
    "text": "Going to the pool is fun. People wear swimsuits and bring towels. The water can be cool. Some pools are deep, and some are shallow. Always listen to the lifeguard and stay safe!"
  },
  {
    "grade": 1,
    "passage_code": "G1-021",
    "title": "How Mammals Care for Their Babies",
    "text": "Step 1: A mammal gives birth to its baby. Step 2: The mother feeds her baby with milk. Step 3: She keeps the baby warm and safe. Step 4: The baby grows and learns from its parent."
  },
  {
    "grade": 1,
    "passage_code": "G1-022",
    "title": "The Rainbow's Missing Color",
    "text": "Red said, \"Where is Blue?\" Orange looked around. \"I can't find Blue!\" Yellow sighed, \"Without Blue, we are not a full rainbow.\" Suddenly, Blue peeked out. \"Here I am! I was playing hide and seek!\" Everyone cheered, \"Now we are complete!\""
  },
  {
    "grade": 1,
    "passage_code": "G1-023",
    "title": "Pushes and Pulls",
    "text": "A push moves something away from you. A pull brings something closer to you. When you open a door, you push or pull it. Pushes and pulls help things move."
  },
  {
    "grade": 1,
    "passage_code": "G1-024",
    "title": "Waffle's Fun Club",
    "text": "One morning, Waffle wanted new friends. Waffle put up a sign: \"Waffle Club!\" Soon, Muffin, Banana, and Egg joined. They played games and laughed. Waffle was happy to have a club!"
  },
  {
    "grade": 1,
    "passage_code": "G1-025",
    "title": "Playing Safe Dodgeball",
    "text": "Let's play dodgeball with a soft, squishy ball! First, everyone stands in a circle. Next, gently toss the ball to your friends. If you are touched, just smile and join the side. Play again and have fun being safe!"
  },
  {
    "grade": 1,
    "passage_code": "G1-026",
    "title": "The Talking Backpack",
    "text": "Mia's backpack started talking at school! When it spoke, Mia laughed and showed her friends. Because the backpack talked, everyone wanted to be Mia's friend and hear its funny stories."
  },
  {
    "grade": 1,
    "passage_code": "G1-027",
    "title": "Making a Play Poster",
    "text": "Anna and her friends want people to come see their play. They make a bright poster. Because the poster is colorful, many people notice it and come to the play."
  },
  {
    "grade": 1,
    "passage_code": "G1-028",
    "title": "Working Together on a Puzzle",
    "text": "Anna and Ben wanted to finish a jigsaw puzzle. It was hard to do alone. They worked together and shared the pieces. Because they helped each other, the puzzle was done quickly and they smiled with pride."
  },
  {
    "grade": 1,
    "passage_code": "G1-029",
    "title": "The Helpful Wizard",
    "text": "Wally is a wizard who loves to help. He waves his wand and makes toys appear for kids to share. He can fix broken bikes and grow pretty flowers. Wally's spells always make people smile!"
  },
  {
    "grade": 1,
    "passage_code": "G1-030",
    "title": "Helping Bake Cookies",
    "text": "I help bake cookies with Mom. First, we wash our hands. Next, we mix the flour, sugar, and eggs. We shape the dough and put it on a tray. Mom puts the cookies in the oven. When they are ready, we let them cool and then enjoy a sweet treat together!"
  },
  {
    "grade": 1,
    "passage_code": "G1-031",
    "title": "Sammy the Talking Squirrel",
    "text": "Sammy is a special squirrel. Unlike other squirrels, Sammy can talk! Other squirrels chatter and squeak, but Sammy says, \"Hello!\" Sammy loves to share stories, while his friends love to find nuts. They are different, but they all play together in the big, leafy tree."
  },
  {
    "grade": 1,
    "passage_code": "G1-032",
    "title": "Building with Cardboard Boxes",
    "text": "Cardboard boxes can be fun to play with. You can stack them to make towers or build a fort. Boxes can become cars, robots, or even houses. Use your imagination to create something new!"
  },
  {
    "grade": 1,
    "passage_code": "G1-033",
    "title": "Making a Thank-You Card",
    "text": "Mia says, \"Let's make a thank-you card for Dad!\" Ben asks, \"What do we need?\" Mia replies, \"Paper, crayons, and stickers!\" Ben smiles, \"I will draw a big heart!\""
  },
  {
    "grade": 1,
    "passage_code": "G1-034",
    "title": "Helping Cook Dinner",
    "text": "First, wash your hands. Next, help by washing the vegetables. Then, hand the spoon to an adult. Last, set the table with forks, plates, and cups. You are a great helper!"
  },
  {
    "grade": 1,
    "passage_code": "G1-035",
    "title": "Making Sock Puppets",
    "text": "When you put a sock on your hand, it can become a puppet. If you add buttons for eyes, your puppet can see. Making sock puppets lets you have fun and tell stories."
  },
  {
    "grade": 1,
    "passage_code": "G1-036",
    "title": "Using a Shopping List",
    "text": "Mom: Let's go shopping! Do we have our list? Anna: Yes, Mom! It says apples, milk, and bread. Mom: Good job. Let's find the apples first! Anna: I see them! Shopping is fun with a list."
  },
  {
    "grade": 1,
    "passage_code": "G1-037",
    "title": "The Quiet Dragon",
    "text": "Daisy is a tiny dragon. She loves soft sounds like humming bees and gentle rain. Loud noises, like thunder and shouting, make Daisy hide. Unlike big dragons who roar, Daisy prefers quiet places. She feels happiest when everything is calm."
  },
  {
    "grade": 1,
    "passage_code": "G1-038",
    "title": "Making a Paper Fan",
    "text": "Anna was hot on a sunny day. She made a paper fan with colorful paper. She waved the fan, and a cool breeze made her feel better. Making a paper fan helps keep you cool."
  },
  {
    "grade": 1,
    "passage_code": "G1-039",
    "title": "Sam's Soccer Goal",
    "text": "Sam wanted to get better at soccer. He set a small goal to kick the ball five times in a row. Because he practiced every day, he reached his goal and felt proud."
  },
  {
    "grade": 1,
    "passage_code": "G1-040",
    "title": "Which Toy Should I Pick?",
    "text": "Mia looks at a teddy bear and a toy car. Mia says, \"I like the teddy bear. It is soft.\" Her friend Sam says, \"The car is fast!\" Mia smiles. \"I think I will choose the teddy bear.\""
  },
  {
    "grade": 1,
    "passage_code": "G1-041",
    "title": "Building in the Sandbox",
    "text": "Lily says, \"Let's build a castle in the sandbox!\" Max smiles, \"Great idea! I will make the walls.\" Lily adds, \"I'll make a tower.\" They laugh and play as their castle grows."
  },
  {
    "grade": 1,
    "passage_code": "G1-042",
    "title": "Tying Shoelaces",
    "text": "Tying shoelaces helps keep your shoes on your feet. First, cross the laces. Then, make a loop. Wrap the other lace around and pull it through. Practice makes it easy!"
  },
  {
    "grade": 1,
    "passage_code": "G1-043",
    "title": "Feeding My Pet",
    "text": "Feeding a pet is easy and fun. First, wash your hands. Next, get your pet's food. Then, put the food in the bowl. Last, watch your pet eat and enjoy!"
  },
  {
    "grade": 1,
    "passage_code": "G1-044",
    "title": "The Silly Treasure Hunt",
    "text": "Max and Mia went on a treasure hunt. They looked under rocks and behind trees. At last, they found a shiny box. Inside was a big rubber duck! They laughed and cheered. The silly prize made their day fun!"
  },
  {
    "grade": 1,
    "passage_code": "G1-045",
    "title": "Catching a Baseball",
    "text": "When Sam watches the baseball, he can see where it will go. Because Sam keeps his eyes on the ball, he can catch it in his glove. This makes Sam feel proud."
  },
  {
    "grade": 1,
    "passage_code": "G1-046",
    "title": "How Igneous Rocks Form",
    "text": "Igneous rocks are made from hot, melted rock called magma. Step 1: Magma comes out of a volcano. Step 2: The magma cools down. Step 3: It becomes a hard rock. That is an igneous rock!"
  },
  {
    "grade": 1,
    "passage_code": "G1-047",
    "title": "Why Bedtime Routines Help",
    "text": "When Anna brushes her teeth and puts on pajamas every night, she feels calm. Because she has a bedtime routine, it is easier for her to fall asleep. Good sleep helps Anna feel happy and ready for a new day."
  },
  {
    "grade": 1,
    "passage_code": "G1-048",
    "title": "Talking About the Wind",
    "text": "Mia: Why are the leaves moving? Dad: The wind is blowing, Mia. Mia: What is wind? Dad: Wind is moving air. Sometimes it is soft, and sometimes it is strong. Mia: I like when the breeze feels cool!"
  },
  {
    "grade": 1,
    "passage_code": "G1-049",
    "title": "A Visit to the Pond",
    "text": "Lily and her dad walked to the pond. They saw frogs hop on green leaves. Ducklings swam in the water. Fish splashed and dragonflies zoomed by. The pond was full of life!"
  },
  {
    "grade": 1,
    "passage_code": "G1-050",
    "title": "How to Say No Politely",
    "text": "Sometimes, we cannot say yes to everything. Here are steps to say no kindly. First, smile and listen. Then, say, 'No, thank you.' Last, offer another idea or say sorry. This way, we are polite and kind."
  },
  {
    "grade": 1,
    "passage_code": "G1-051",
    "title": "Sharing the Ball",
    "text": "Mia and Ben are at the park. Mia says, \"Can I play with the ball?\" Ben smiles and says, \"Yes, let's share!\" They take turns kicking the ball. They laugh and have fun together."
  },
  {
    "grade": 1,
    "passage_code": "G1-052",
    "title": "Baseball Batting Fun",
    "text": "Sam holds a bat. \"I want to hit the ball,\" he says. Coach smiles. \"Watch the ball, swing, and have fun!\" Sam swings. Crack! The ball flies. \"Great job, Sam!\" says Coach."
  },
  {
    "grade": 1,
    "passage_code": "G1-053",
    "title": "A Tidy Desk and a Messy Desk",
    "text": "A tidy desk has books stacked and pencils in a cup. It is easy to find things. A messy desk has papers everywhere. It is hard to find things. Which do you like better?"
  },
  {
    "grade": 1,
    "passage_code": "G1-054",
    "title": "Pond Habitats",
    "text": "A pond is a small body of water. Many animals live in ponds. Frogs jump on lily pads. Fish swim in the water. Ducks float on top. Plants grow in ponds too. Ponds are homes for many living things."
  },
  {
    "grade": 1,
    "passage_code": "G1-055",
    "title": "Nighttime Friends",
    "text": "At night, the world gets quiet. But some animals wake up! Owls hoot in the trees. Bats fly and look for bugs. Raccoons search for food. These are nocturnal animals. They love the night!"
  },
  {
    "grade": 1,
    "passage_code": "G1-056",
    "title": "Ocean Habitats",
    "text": "The ocean is a big, salty home for many animals. Fish, whales, and dolphins live in the ocean. Seaweed grows there, too. Oceans are wet, cold, and full of life!"
  },
  {
    "grade": 1,
    "passage_code": "G1-057",
    "title": "The Secret Clubhouse",
    "text": "Mia and Ben found a small door under the stairs. They opened it and built a secret clubhouse inside. Because they had a special place, they felt happy and safe."
  },
  {
    "grade": 1,
    "passage_code": "G1-058",
    "title": "Zipping My Coat",
    "text": "It is cold outside. I put on my red coat. The zipper is hard to pull. I try again. Zip! My coat is closed. Now I am warm and ready to play."
  },
  {
    "grade": 1,
    "passage_code": "G1-059",
    "title": "Playing Volleyball Together",
    "text": "In volleyball, you can play alone or with a team. When you play alone, you must hit the ball by yourself. With a team, you work together. Teamwork helps you win and makes the game more fun!"
  },
  {
    "grade": 1,
    "passage_code": "G1-060",
    "title": "Helping with Recycling",
    "text": "Mia and her dad put bottles and cans into a blue bin. She learns that recycling keeps the Earth clean. Mia feels happy to help her family and the planet."
  },
  {
    "grade": 1,
    "passage_code": "G1-061",
    "title": "Counting Coins",
    "text": "Anna counts her coins. She finds three pennies and two nickels. Because Anna knows how to count coins, she can buy a sticker. Counting helps Anna get what she wants."
  },
  {
    "grade": 1,
    "passage_code": "G1-062",
    "title": "Playing Fair at Recess",
    "text": "At recess, Mia and her friends played tag. Mia wanted everyone to have fun. She made sure everyone took turns being 'it.' When someone fell, Mia stopped to help. Playing fair made everyone happy."
  },
  {
    "grade": 1,
    "passage_code": "G1-063",
    "title": "Fiona the Button Fox",
    "text": "Fiona the fox found a shiny button. \"Look what I found!\" she said. Her friend, Bunny, smiled. \"You have so many buttons!\" Fiona giggled, \"I like to collect them and share. Would you like one?\" Bunny nodded, happy to have a new button friend."
  },
  {
    "grade": 1,
    "passage_code": "G1-064",
    "title": "Packing for a Short Trip",
    "text": "When you pack for a short trip, you take a small bag. You pack just a few clothes and a toothbrush. For a long trip, you need a big bag and more things. Short trips need less, long trips need more. That is the difference."
  },
  {
    "grade": 1,
    "passage_code": "G1-065",
    "title": "A Safe Small Bag",
    "text": "Mom: Are you ready for school, Mia? Mia: Yes, Mom! I have my small bag. Mom: That's good. Is it light? Mia: Yes, it's easy to carry. Mom: Great! Carrying a small bag is safe for you."
  },
  {
    "grade": 1,
    "passage_code": "G1-066",
    "title": "Why Some Animals Come Out at Night",
    "text": "Some animals are called nocturnal because they are awake at night. They come out when it is dark to find food. Being awake at night keeps them safe from animals that hunt during the day."
  },
  {
    "grade": 1,
    "passage_code": "G1-067",
    "title": "Skating Forward",
    "text": "Mia put on her skates and stepped onto the ice. She pushed one foot forward, then the other. Soon, Mia was gliding smoothly. \"Look at me!\" she cheered, skating across the rink."
  },
  {
    "grade": 1,
    "passage_code": "G1-068",
    "title": "Steps to See the Moon Change",
    "text": "Step 1: Go outside at night and look up. Step 2: Find the moon in the sky. Step 3: Notice its shape. Step 4: Look again each night. The moon changes from a thin curve to a big circle and back again!"
  },
  {
    "grade": 1,
    "passage_code": "G1-069",
    "title": "The Brave Little Sock",
    "text": "Sam was a little blue sock. One day, he got lost behind the dryer. Sam was scared, but he called out for help. Soon, his friend the red sock heard him and pulled him out. Sam was brave and happy to be safe again!"
  },
  {
    "grade": 1,
    "passage_code": "G1-070",
    "title": "Making a Robot",
    "text": "Sam and Mia wanted to play. They found boxes, bottles, and paper rolls. They made a robot from the old things. It had bottle arms and a box head. They smiled at their new toy."
  },
  {
    "grade": 1,
    "passage_code": "G1-071",
    "title": "Rock Talk",
    "text": "Mia finds a rock. She asks, \"What kind of rock are you?\" The rock says, \"I am a metamorphic rock. I changed because of heat and pressure!\" Mia smiles, \"Wow, you are special!\""
  },
  {
    "grade": 1,
    "passage_code": "G1-072",
    "title": "Talking About Leaves",
    "text": "Mia sees a plant. She asks, \"What are these green things?\" Dad says, \"Those are leaves. Leaves help the plant make food from the sun.\" Mia smiles, \"Leaves are important!\""
  },
  {
    "grade": 1,
    "passage_code": "G1-073",
    "title": "Pool Safety Rules",
    "text": "At the pool, being safe is different from being unsafe. Safe swimmers walk by the pool, but unsafe swimmers run and might fall. Safe swimmers listen to the lifeguard, but unsafe swimmers do not pay attention. Being safe helps everyone have fun at the pool."
  },
  {
    "grade": 1,
    "passage_code": "G1-074",
    "title": "A New Friend Joins the Game",
    "text": "Anna and Ben were playing ball at the park. Mia watched them from a bench. Anna smiled and said, \"Would you like to play with us?\" Mia nodded happily. Now, all three friends played together and laughed."
  },
  {
    "grade": 1,
    "passage_code": "G1-075",
    "title": "Gerry the Gentle Ghost",
    "text": "Gerry is a ghost, but he is not scary. Other ghosts like spooky stories, but Gerry does not. He likes happy stories about friends. Gerry feels safe when stories are kind, not scary. He is different, but his friends love him just as he is."
  },
  {
    "grade": 1,
    "passage_code": "G1-076",
    "title": "Music Lesson Day",
    "text": "On music lesson day, we play different instruments. Some kids play the piano. Others play the drums. The piano sounds soft and gentle. The drums are loud and fast. Each instrument makes music in its own way."
  },
  {
    "grade": 1,
    "passage_code": "G1-077",
    "title": "Cheering for Our Team",
    "text": "Sports are fun to play with friends. When a teammate feels sad or tired, we can cheer them on. Saying, 'You can do it!' helps everyone feel happy and do their best."
  },
  {
    "grade": 1,
    "passage_code": "G1-078",
    "title": "Shadow Puppet Fun",
    "text": "Mia: Look! I can make a dog with my hands. Tom: Wow! The dog shadow is on the wall. Mia: Can you make a bird? Tom: Yes! Flap, flap! Let's play shadow puppets together!"
  },
  {
    "grade": 1,
    "passage_code": "G1-079",
    "title": "How to Play Capture-the-Flag Safely",
    "text": "First, split into two teams. Set up safe zones and a flag for each team. Remember to run carefully and watch where you are going. Always listen to the rules. Have fun and play fair!"
  },
  {
    "grade": 1,
    "passage_code": "G1-080",
    "title": "Following a Schedule",
    "text": "A schedule helps us know what to do each day. We wake up, brush our teeth, eat breakfast, and go to school. Following a schedule keeps us on track and helps us learn new things."
  },
  {
    "grade": 1,
    "passage_code": "G1-081",
    "title": "Hockey Helpers",
    "text": "Anna and her friends play hockey. They pass the puck to each other. When someone falls, the team helps them up. Working together, they score a goal. Hockey is fun with teamwork!"
  },
  {
    "grade": 1,
    "passage_code": "G1-082",
    "title": "Domino Chain Fun",
    "text": "Sam lines up his dominoes in a row. When he pushes the first one, it falls and bumps the next. Because he started the chain, all the dominoes fall down. Sam laughs and sets them up again."
  },
  {
    "grade": 1,
    "passage_code": "G1-083",
    "title": "The Mystery of the Missing Sticker",
    "text": "Lila had a shiny star sticker. She placed it on her notebook. The next day, it was gone! Lila looked under her desk. She found her sticker stuck to her shoe. Mystery solved!"
  },
  {
    "grade": 1,
    "passage_code": "G1-084",
    "title": "Talking About Igneous Rocks",
    "text": "Mia sees a shiny rock. \"What is this?\" she asks. Dad smiles. \"That is an igneous rock. It comes from hot, melted lava that cools down.\" Mia says, \"Wow, rocks can be made from lava!\""
  },
  {
    "grade": 1,
    "passage_code": "G1-085",
    "title": "Building with Magnet Tiles",
    "text": "Sam and Mia have colorful magnet tiles. They snap the tiles together to make a tall tower. The tower falls down, but Sam and Mia laugh. They build it again and feel happy playing together."
  },
  {
    "grade": 1,
    "passage_code": "G1-086",
    "title": "Reading in the Library",
    "text": "Mia: Look at all the books! Dad: Do you want to read one? Mia: Yes! I like this red book. Dad: Let's sit and read together. Mia: I love reading in the library!"
  },
  {
    "grade": 1,
    "passage_code": "G1-087",
    "title": "Igneous Rocks",
    "text": "Igneous rocks are made from cooled lava or melted rock. They can be smooth or rough. Some igneous rocks have tiny crystals. Granite is a type of igneous rock. Igneous rocks are found all around us!"
  },
  {
    "grade": 1,
    "passage_code": "G1-088",
    "title": "Day and Night at the Park",
    "text": "Mia goes to the park in the morning. The sun is bright, and she plays with her friends. At night, Mia looks outside. The moon and stars shine in the sky. Mia waves goodnight to the park."
  },
  {
    "grade": 1,
    "passage_code": "G1-089",
    "title": "Asteroids and Comets",
    "text": "Asteroids are big rocks that move around the Sun. Comets are made of ice and dust. When comets get close to the Sun, they grow bright tails. Both are part of our solar system."
  },
  {
    "grade": 1,
    "passage_code": "G1-090",
    "title": "The Helpful Pulley",
    "text": "Anna wanted to lift her toy box. It was heavy! Dad showed her a pulley. They put a rope over a wheel. Anna pulled the rope. Up went the box! Anna cheered. The pulley made lifting easy."
  },
  {
    "grade": 1,
    "passage_code": "G1-091",
    "title": "Agility Ladder Drills",
    "text": "An agility ladder is a tool used in sports. It looks like a flat ladder on the ground. Kids step in and out of the spaces quickly. This helps them move fast and stay balanced."
  },
  {
    "grade": 1,
    "passage_code": "G1-092",
    "title": "Taekwondo Kicks",
    "text": "Mia: What are we learning today? Coach Lee: We will learn safe taekwondo kicks! Mia: Are they fun? Coach Lee: Yes! We kick gently and carefully. Mia: I am ready to try!"
  },
  {
    "grade": 1,
    "passage_code": "G1-093",
    "title": "Practice at the Rink",
    "text": "Sam goes to the rink to practice skating. The ice is cold and smooth. Sam wears skates and a helmet. Practice helps Sam skate faster. Skating is fun and safe with gear."
  },
  {
    "grade": 1,
    "passage_code": "G1-094",
    "title": "The Singing Chair",
    "text": "Mia sat down. \"Squeak! La la la!\" sang the chair. Mia giggled. \"Chair, can you sing again?\" she asked. The chair squeaked, \"Do re mi!\" Mia clapped. \"You are funny!\" she said."
  },
  {
    "grade": 1,
    "passage_code": "G1-095",
    "title": "The Magic Seesaw",
    "text": "In the park, Mia found a magic seesaw. When she felt sad, the seesaw lifted her up. When she felt happy, it gently rocked. Mia learned that it's okay to feel both happy and sad."
  },
  {
    "grade": 1,
    "passage_code": "G1-096",
    "title": "The Brave Little Sock",
    "text": "Step 1: A little blue sock falls behind the dresser. Step 2: The sock feels scared and alone. Step 3: The sock calls for help. Step 4: A kind cat finds the sock. Step 5: The sock is happy and brave again."
  },
  {
    "grade": 1,
    "passage_code": "G1-097",
    "title": "Sam and the Talking Skateboard",
    "text": "Step 1: Sam found a shiny skateboard in the park. Step 2: The skateboard said, 'Let's go for a ride!' Step 3: Sam hopped on and zoomed down the path. Step 4: They laughed and played until sunset."
  },
  {
    "grade": 1,
    "passage_code": "G1-098",
    "title": "The Garden Gnome's Notes",
    "text": "In a little garden lives a gnome named Gus. Gus loves to write friendly notes. Every morning, he leaves notes for the flowers and bugs. The notes say, \"Good morning!\" or \"You are special!\" The garden feels happy because of Gus's kind words."
  },
  {
    "grade": 1,
    "passage_code": "G1-099",
    "title": "Building a Tall Tower",
    "text": "Mia and Ben stacked blocks to build a tall tower. Because they put big blocks at the bottom, the tower stayed strong. When they used small blocks on top, it did not fall. Their careful building made the tower stand tall."
  },
  {
    "grade": 1,
    "passage_code": "G1-100",
    "title": "How to Row a Boat",
    "text": "Rowing a boat is fun! First, sit in the boat. Hold the oars with both hands. Next, pull the oars back to move the boat. Push the oars forward to go again. Repeat these steps to row across the water."
  }
]